[Killed] MethodExpression
src/analyzers/scorers/auditable-scorer.ts:15:20
  * 2 = ADRs + Status.md + commit config, 1 = some subset, 0 = none.
  */
 export function scoreAuditable(projectDir: string, allFiles: string[]): GsPropertyScore {
-  const adrFiles = allFiles.filter(
-    (f) =>
-      /docs\/(adrs?|decisions?|rfcs?)\//i.test(f.replace(/\\/g, "/")) &&
-      f.endsWith(".md"),
-  );
+  const adrFiles = allFiles;
   const hasAdrs = adrFiles.length > 0;
 
killedBy: evidence content — partial signals non-ADR markdown files do not inflate ADR count
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArrowFunction
src/analyzers/scorers/auditable-scorer.ts:16:5
  */
 export function scoreAuditable(projectDir: string, allFiles: string[]): GsPropertyScore {
   const adrFiles = allFiles.filter(
-    (f) =>
-      /docs\/(adrs?|decisions?|rfcs?)\//i.test(f.replace(/\\/g, "/")) &&
-      f.endsWith(".md"),
+    () => undefined,
   );
   const hasAdrs = adrFiles.length > 0;
killedBy: score 1 — partial signals returns score 1 with only ADRs
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/auditable-scorer.ts:17:7
 export function scoreAuditable(projectDir: string, allFiles: string[]): GsPropertyScore {
   const adrFiles = allFiles.filter(
     (f) =>
-      /docs\/(adrs?|decisions?|rfcs?)\//i.test(f.replace(/\\/g, "/")) &&
-      f.endsWith(".md"),
+      true,
   );
   const hasAdrs = adrFiles.length > 0;
killedBy: evidence content — partial signals non-ADR markdown files do not inflate ADR count
statusReason: expected 2 to be 1 // Object.is equality

[Killed] LogicalOperator
src/analyzers/scorers/auditable-scorer.ts:17:7
 export function scoreAuditable(projectDir: string, allFiles: string[]): GsPropertyScore {
   const adrFiles = allFiles.filter(
     (f) =>
-      /docs\/(adrs?|decisions?|rfcs?)\//i.test(f.replace(/\\/g, "/")) &&
-      f.endsWith(".md"),
+      /docs\/(adrs?|decisions?|rfcs?)\//i.test(f.replace(/\\/g, "/")) || f.endsWith(".md"),
   );
   const hasAdrs = adrFiles.length > 0;
killedBy: evidence content — partial signals non-ADR markdown files do not inflate ADR count
statusReason: expected 2 to be 1 // Object.is equality

[Killed] MethodExpression
src/analyzers/scorers/auditable-scorer.ts:18:7
   const adrFiles = allFiles.filter(
     (f) =>
       /docs\/(adrs?|decisions?|rfcs?)\//i.test(f.replace(/\\/g, "/")) &&
-      f.endsWith(".md"),
+      f.startsWith(".md"),
   );
   const hasAdrs = adrFiles.length > 0;
killedBy: score 1 — partial signals returns score 1 with only ADRs
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/auditable-scorer.ts:20:19
       /docs\/(adrs?|decisions?|rfcs?)\//i.test(f.replace(/\\/g, "/")) &&
       f.endsWith(".md"),
   );
-  const hasAdrs = adrFiles.length > 0;
+  const hasAdrs = false;
 
   const statusPaths = ["Status.md", "status.md", "STATUS.md", "CHANGELOG.md"];
killedBy: score 1 — partial signals returns score 1 with only ADRs
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/analyzers/scorers/auditable-scorer.ts:20:19
       /docs\/(adrs?|decisions?|rfcs?)\//i.test(f.replace(/\\/g, "/")) &&
       f.endsWith(".md"),
   );
-  const hasAdrs = adrFiles.length > 0;
+  const hasAdrs = adrFiles.length >= 0;
 
   const statusPaths = ["Status.md", "status.md", "STATUS.md", "CHANGELOG.md"];
killedBy: score 0 — nothing present returns score 0 when project is empty
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrowFunction
src/analyzers/scorers/auditable-scorer.ts:23:38
   const hasAdrs = adrFiles.length > 0;
 
   const statusPaths = ["Status.md", "status.md", "STATUS.md", "CHANGELOG.md"];
-  const hasStatus = statusPaths.some((p) => existsSync(join(projectDir, p)));
+  const hasStatus = statusPaths.some(() => undefined);
 
   const commitConfigs = [
killedBy: score 1 — partial signals returns score 1 with only Status.md
statusReason: expected +0 to be 1 // Object.is equality

[Killed] MethodExpression
src/analyzers/scorers/auditable-scorer.ts:23:21
   const hasAdrs = adrFiles.length > 0;
 
   const statusPaths = ["Status.md", "status.md", "STATUS.md", "CHANGELOG.md"];
-  const hasStatus = statusPaths.some((p) => existsSync(join(projectDir, p)));
+  const hasStatus = statusPaths.every(p => existsSync(join(projectDir, p)));
 
   const commitConfigs = [
killedBy: score 1 — partial signals returns score 1 with only Status.md
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
src/analyzers/scorers/auditable-scorer.ts:30:46
     ".commitlintrc.js", ".commitlintrc.json", ".commitlintrc.yaml",
     ".husky/commit-msg",
   ];
-  const hasCommitConfig = commitConfigs.some((p) => existsSync(join(projectDir, p)));
+  const hasCommitConfig = commitConfigs.some(() => undefined);
 
   const signals = [hasAdrs, hasStatus, hasCommitConfig].filter(Boolean).length;
killedBy: score 1 — partial signals returns score 1 with only commit config
statusReason: expected +0 to be 1 // Object.is equality

[Killed] MethodExpression
src/analyzers/scorers/auditable-scorer.ts:30:27
     ".commitlintrc.js", ".commitlintrc.json", ".commitlintrc.yaml",
     ".husky/commit-msg",
   ];
-  const hasCommitConfig = commitConfigs.some((p) => existsSync(join(projectDir, p)));
+  const hasCommitConfig = commitConfigs.every(p => existsSync(join(projectDir, p)));
 
   const signals = [hasAdrs, hasStatus, hasCommitConfig].filter(Boolean).length;
killedBy: score 1 — partial signals returns score 1 with only commit config
statusReason: expected +0 to be 1 // Object.is equality

[Killed] MethodExpression
src/analyzers/scorers/auditable-scorer.ts:32:19
   ];
   const hasCommitConfig = commitConfigs.some((p) => existsSync(join(projectDir, p)));
 
-  const signals = [hasAdrs, hasStatus, hasCommitConfig].filter(Boolean).length;
+  const signals = [hasAdrs, hasStatus, hasCommitConfig].length;
 
   if (signals === 3) {
killedBy: score 0 — nothing present returns score 0 when project is empty
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/analyzers/scorers/auditable-scorer.ts:34:22
 
   const signals = [hasAdrs, hasStatus, hasCommitConfig].filter(Boolean).length;
 
-  if (signals === 3) {
-    return gs("auditable", 2, [
-      `${adrFiles.length} ADR file(s) found in docs/adrs/`,
-      "Status.md / CHANGELOG.md present",
-      "Conventional commit configuration present",
-    ]);
-  }
+  if (signals === 3) {}
 
   if (signals >= 1) {
killedBy: score 2 — all three signals returns score 2 with ADRs + Status + commit config
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
src/analyzers/scorers/auditable-scorer.ts:34:7
 
   const signals = [hasAdrs, hasStatus, hasCommitConfig].filter(Boolean).length;
 
-  if (signals === 3) {
+  if (signals !== 3) {
     return gs("auditable", 2, [
       `${adrFiles.length} ADR file(s) found in docs/adrs/`,
killedBy: score 0 — nothing present returns score 0 when project is empty
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/analyzers/scorers/auditable-scorer.ts:42:21
     ]);
   }
 
-  if (signals >= 1) {
-    const present: string[] = [];
-    const absent: string[] = [];
-    if (hasAdrs) present.push(`${adrFiles.length} ADR(s)`);
-    else absent.push("ADRs in docs/adrs/");
-    if (hasStatus) present.push("Status.md");
-    else absent.push("Status.md / CHANGELOG.md");
-    if (hasCommitConfig) present.push("commit config");
-    else absent.push("commitlint config");
-
-    return gs("auditable", 1, [
-      `Present: ${present.join(", ")}`,
-      `Missing: ${absent.join(", ")}`,
-    ]);
-  }
+  if (signals >= 1) {}
 
   return gs("auditable", 0, [
killedBy: score 1 — partial signals returns score 1 with only Status.md
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/auditable-scorer.ts:42:7
     ]);
   }
 
-  if (signals >= 1) {
+  if (false) {
     const present: string[] = [];
     const absent: string[] = [];
killedBy: score 1 — partial signals returns score 1 with only Status.md
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/auditable-scorer.ts:45:9
   if (signals >= 1) {
     const present: string[] = [];
     const absent: string[] = [];
-    if (hasAdrs) present.push(`${adrFiles.length} ADR(s)`);
+    if (true) present.push(`${adrFiles.length} ADR(s)`);
     else absent.push("ADRs in docs/adrs/");
     if (hasStatus) present.push("Status.md");
killedBy: evidence content — partial signals absent items appear under Missing: label, not Present:
statusReason: expected 'Missing: commitlint config' to contain 'ADR'

[Survived] ConditionalExpression
src/analyzers/scorers/auditable-scorer.ts:45:9
   if (signals >= 1) {
     const present: string[] = [];
     const absent: string[] = [];
-    if (hasAdrs) present.push(`${adrFiles.length} ADR(s)`);
+    if (false) present.push(`${adrFiles.length} ADR(s)`);
     else absent.push("ADRs in docs/adrs/");
     if (hasStatus) present.push("Status.md");

[Killed] ConditionalExpression
src/analyzers/scorers/auditable-scorer.ts:47:9
     const absent: string[] = [];
     if (hasAdrs) present.push(`${adrFiles.length} ADR(s)`);
     else absent.push("ADRs in docs/adrs/");
-    if (hasStatus) present.push("Status.md");
+    if (false) present.push("Status.md");
     else absent.push("Status.md / CHANGELOG.md");
     if (hasCommitConfig) present.push("commit config");
killedBy: evidence content — partial signals absent items appear under Missing: label, not Present:
statusReason: expected 'Present: ' to contain 'Status.md'

[Survived] ConditionalExpression
src/analyzers/scorers/auditable-scorer.ts:47:9
     const absent: string[] = [];
     if (hasAdrs) present.push(`${adrFiles.length} ADR(s)`);
     else absent.push("ADRs in docs/adrs/");
-    if (hasStatus) present.push("Status.md");
+    if (true) present.push("Status.md");
     else absent.push("Status.md / CHANGELOG.md");
     if (hasCommitConfig) present.push("commit config");

[Killed] ConditionalExpression
src/analyzers/scorers/auditable-scorer.ts:49:9
     else absent.push("ADRs in docs/adrs/");
     if (hasStatus) present.push("Status.md");
     else absent.push("Status.md / CHANGELOG.md");
-    if (hasCommitConfig) present.push("commit config");
+    if (true) present.push("commit config");
     else absent.push("commitlint config");
 
killedBy: evidence content — partial signals absent items appear under Missing: label, not Present:
statusReason: expected 'Missing: ADRs in docs/adrs/' to contain 'commitlint'

[Survived] ConditionalExpression
src/analyzers/scorers/auditable-scorer.ts:49:9
     else absent.push("ADRs in docs/adrs/");
     if (hasStatus) present.push("Status.md");
     else absent.push("Status.md / CHANGELOG.md");
-    if (hasCommitConfig) present.push("commit config");
+    if (false) present.push("commit config");
     else absent.push("commitlint config");
 

[Killed] ArrayDeclaration
src/analyzers/scorers/auditable-scorer.ts:58:29
     ]);
   }
 
-  return gs("auditable", 0, [
-    "No ADRs found (expected in docs/adrs/)",
-    "No Status.md or CHANGELOG.md found",
-    "No conventional commit configuration found",
-  ]);
+  return gs("auditable", 0, []);
 }
 
killedBy: score 0 — nothing present returns score 0 when project is empty
statusReason: .toMatch() expects to receive a string, but got undefined
