[Killed] BlockStatement
src/tools/change-request.ts:62:62
 
 // ── Slug generation ───────────────────────────────────────────────────
 
-export function slugify(title: string, date: string): string {
-  const slug = title
-    .toLowerCase()
-    .replace(/[^a-z0-9\s-]/g, "")
-    .trim()
-    .replace(/\s+/g, "-")
-    .slice(0, 40)
-    .replace(/-+$/, "");
-  return `chg-${date}-${slug}`;
-}
+export function slugify(title: string, date: string): string {}
 
 // ── Artifact detection ────────────────────────────────────────────────
killedBy: slugify produces chg-<date>-<slug> format
statusReason: expected undefined to be 'chg-2026-04-19-replace-jwt-middleware' // Object.is equality

[Killed] MethodExpression
src/tools/change-request.ts:63:16
 // ── Slug generation ───────────────────────────────────────────────────
 
 export function slugify(title: string, date: string): string {
-  const slug = title
-    .toLowerCase()
-    .replace(/[^a-z0-9\s-]/g, "")
-    .trim()
-    .replace(/\s+/g, "-")
-    .slice(0, 40)
+  const slug = title.toLowerCase().replace(/[^a-z0-9\s-]/g, "").trim().replace(/\s+/g, "-")
     .replace(/-+$/, "");
   return `chg-${date}-${slug}`;
killedBy: slugify truncates slug to 40 chars
statusReason: expected 71 to be less than or equal to 40

[Killed] MethodExpression
src/tools/change-request.ts:63:16
 // ── Slug generation ───────────────────────────────────────────────────
 
 export function slugify(title: string, date: string): string {
-  const slug = title
-    .toLowerCase()
+  const slug = title.toUpperCase()
     .replace(/[^a-z0-9\s-]/g, "")
     .trim()
killedBy: slugify produces chg-<date>-<slug> format
statusReason: expected 'chg-2026-04-19-' to be 'chg-2026-04-19-replace-jwt-middleware' // Object.is equality

[Killed] Regex
src/tools/change-request.ts:65:14
 export function slugify(title: string, date: string): string {
   const slug = title
     .toLowerCase()
-    .replace(/[^a-z0-9\s-]/g, "")
+    .replace(/[a-z0-9\s-]/g, "")
     .trim()
     .replace(/\s+/g, "-")
killedBy: slugify produces chg-<date>-<slug> format
statusReason: expected 'chg-2026-04-19-' to be 'chg-2026-04-19-replace-jwt-middleware' // Object.is equality

[Killed] Regex
src/tools/change-request.ts:65:14
 export function slugify(title: string, date: string): string {
   const slug = title
     .toLowerCase()
-    .replace(/[^a-z0-9\s-]/g, "")
+    .replace(/[^a-z0-9\S-]/g, "")
     .trim()
     .replace(/\s+/g, "-")
killedBy: slugify produces chg-<date>-<slug> format
statusReason: expected 'chg-2026-04-19-replacejwtmiddleware' to be 'chg-2026-04-19-replace-jwt-middleware' // Object.is equality

[Killed] Regex
src/tools/change-request.ts:67:14
     .toLowerCase()
     .replace(/[^a-z0-9\s-]/g, "")
     .trim()
-    .replace(/\s+/g, "-")
+    .replace(/\s/g, "-")
     .slice(0, 40)
     .replace(/-+$/, "");
killedBy: slugify collapses multiple consecutive spaces into a single dash
statusReason: expected 'chg-2026-04-01-hello--world' to be 'chg-2026-04-01-hello-world' // Object.is equality

[Killed] Regex
src/tools/change-request.ts:69:14
     .trim()
     .replace(/\s+/g, "-")
     .slice(0, 40)
-    .replace(/-+$/, "");
+    .replace(/-+/, "");
   return `chg-${date}-${slug}`;
 }
killedBy: slugify produces chg-<date>-<slug> format
statusReason: expected 'chg-2026-04-19-replacejwt-middleware' to be 'chg-2026-04-19-replace-jwt-middleware' // Object.is equality

[Killed] ConditionalExpression
src/tools/change-request.ts:82:84
   type: ChangeType,
 ): string[] {
   const artifacts: string[] = [];
-  const words = `${title} ${description}`.toLowerCase().split(/\s+/).filter((w) => w.length > 3);
+  const words = `${title} ${description}`.toLowerCase().split(/\s+/).filter((w) => true);
 
   const specFiles: Array<[string, string[]]> = [
killedBy: detectAffectedArtifacts short words (≤3 chars) are excluded from keyword matching
statusReason: expected [ 'docs/adrs/' ] to not include 'docs/adrs/'

[Killed] EqualityOperator
src/tools/change-request.ts:82:84
   type: ChangeType,
 ): string[] {
   const artifacts: string[] = [];
-  const words = `${title} ${description}`.toLowerCase().split(/\s+/).filter((w) => w.length > 3);
+  const words = `${title} ${description}`.toLowerCase().split(/\s+/).filter((w) => w.length >= 3);
 
   const specFiles: Array<[string, string[]]> = [
killedBy: detectAffectedArtifacts short words (≤3 chars) are excluded from keyword matching
statusReason: expected [ 'docs/adrs/' ] to not include 'docs/adrs/'

[Killed] ArrayDeclaration
src/tools/change-request.ts:84:48
   const artifacts: string[] = [];
   const words = `${title} ${description}`.toLowerCase().split(/\s+/).filter((w) => w.length > 3);
 
-  const specFiles: Array<[string, string[]]> = [
-    ["docs/PRD.md", ["requirement", "product", "feature", "user", "problem"]],
-    ["docs/use-cases.md", ["use case", "actor", "workflow", "uc-", "flow"]],
-    ["docs/TechSpec.md", ["architecture", "implementation", "component", "system"]],
-  ];
+  const specFiles: Array<[string, string[]]> = [];
 
   for (const [path, keywords] of specFiles) {
killedBy: detectAffectedArtifacts includes use-cases.md when title contains 'workflow'
statusReason: expected [] to include 'docs/use-cases.md'

[Survived] ArrayDeclaration
src/tools/change-request.ts:85:21
   const words = `${title} ${description}`.toLowerCase().split(/\s+/).filter((w) => w.length > 3);
 
   const specFiles: Array<[string, string[]]> = [
-    ["docs/PRD.md", ["requirement", "product", "feature", "user", "problem"]],
+    ["docs/PRD.md", []],
     ["docs/use-cases.md", ["use case", "actor", "workflow", "uc-", "flow"]],
     ["docs/TechSpec.md", ["architecture", "implementation", "component", "system"]],

[Killed] ArrayDeclaration
src/tools/change-request.ts:86:27
 
   const specFiles: Array<[string, string[]]> = [
     ["docs/PRD.md", ["requirement", "product", "feature", "user", "problem"]],
-    ["docs/use-cases.md", ["use case", "actor", "workflow", "uc-", "flow"]],
+    ["docs/use-cases.md", []],
     ["docs/TechSpec.md", ["architecture", "implementation", "component", "system"]],
   ];
killedBy: detectAffectedArtifacts includes use-cases.md when title contains 'workflow'
statusReason: expected [] to include 'docs/use-cases.md'

[Killed] BlockStatement
src/tools/change-request.ts:90:45
     ["docs/TechSpec.md", ["architecture", "implementation", "component", "system"]],
   ];
 
-  for (const [path, keywords] of specFiles) {
-    if (!existsSync(join(projectDir, path))) continue;
-    const hits = keywords.filter((kw) => words.some((w) => w.includes(kw.replace(/\s+/, ""))));
-    if (hits.length > 0 || type === "spec-change") {
-      artifacts.push(path);
-    }
-  }
+  for (const [path, keywords] of specFiles) {}
 
   // Always include PRD if spec-change type
killedBy: detectAffectedArtifacts includes use-cases.md when title contains 'workflow'
statusReason: expected [] to include 'docs/use-cases.md'

[Killed] ConditionalExpression
src/tools/change-request.ts:91:9
   ];
 
   for (const [path, keywords] of specFiles) {
-    if (!existsSync(join(projectDir, path))) continue;
+    if (false) continue;
     const hits = keywords.filter((kw) => words.some((w) => w.includes(kw.replace(/\s+/, ""))));
     if (hits.length > 0 || type === "spec-change") {
killedBy: detectAffectedArtifacts does not include files that do not exist
statusReason: expected [ 'docs/TechSpec.md' ] to deeply equal []

[Killed] BooleanLiteral
src/tools/change-request.ts:91:9
   ];
 
   for (const [path, keywords] of specFiles) {
-    if (!existsSync(join(projectDir, path))) continue;
+    if (existsSync(join(projectDir, path))) continue;
     const hits = keywords.filter((kw) => words.some((w) => w.includes(kw.replace(/\s+/, ""))));
     if (hits.length > 0 || type === "spec-change") {
killedBy: detectAffectedArtifacts includes use-cases.md when title contains 'workflow'
statusReason: expected [] to include 'docs/use-cases.md'

[Killed] ArrowFunction
src/tools/change-request.ts:92:53
 
   for (const [path, keywords] of specFiles) {
     if (!existsSync(join(projectDir, path))) continue;
-    const hits = keywords.filter((kw) => words.some((w) => w.includes(kw.replace(/\s+/, ""))));
+    const hits = keywords.filter((kw) => words.some(() => undefined));
     if (hits.length > 0 || type === "spec-change") {
       artifacts.push(path);
killedBy: detectAffectedArtifacts includes use-cases.md when title contains 'workflow'
statusReason: expected [] to include 'docs/use-cases.md'

[Killed] MethodExpression
src/tools/change-request.ts:92:42
 
   for (const [path, keywords] of specFiles) {
     if (!existsSync(join(projectDir, path))) continue;
-    const hits = keywords.filter((kw) => words.some((w) => w.includes(kw.replace(/\s+/, ""))));
+    const hits = keywords.filter((kw) => words.every(w => w.includes(kw.replace(/\s+/, ""))));
     if (hits.length > 0 || type === "spec-change") {
       artifacts.push(path);
killedBy: detectAffectedArtifacts includes use-cases.md when title contains 'workflow'
statusReason: expected [] to include 'docs/use-cases.md'

[Killed] EqualityOperator
src/tools/change-request.ts:93:9
   for (const [path, keywords] of specFiles) {
     if (!existsSync(join(projectDir, path))) continue;
     const hits = keywords.filter((kw) => words.some((w) => w.includes(kw.replace(/\s+/, ""))));
-    if (hits.length > 0 || type === "spec-change") {
+    if (hits.length <= 0 || type === "spec-change") {
       artifacts.push(path);
     }
killedBy: detectAffectedArtifacts includes use-cases.md when title contains 'workflow'
statusReason: expected [] to include 'docs/use-cases.md'

[Killed] BlockStatement
src/tools/change-request.ts:93:52
   for (const [path, keywords] of specFiles) {
     if (!existsSync(join(projectDir, path))) continue;
     const hits = keywords.filter((kw) => words.some((w) => w.includes(kw.replace(/\s+/, ""))));
-    if (hits.length > 0 || type === "spec-change") {
-      artifacts.push(path);
-    }
+    if (hits.length > 0 || type === "spec-change") {}
   }
 
killedBy: detectAffectedArtifacts includes use-cases.md when title contains 'workflow'
statusReason: expected [] to include 'docs/use-cases.md'

[Killed] BooleanLiteral
src/tools/change-request.ts:99:33
   }
 
   // Always include PRD if spec-change type
-  if (type === "spec-change" && !artifacts.includes("docs/PRD.md")) {
+  if (type === "spec-change" && artifacts.includes("docs/PRD.md")) {
     if (existsSync(join(projectDir, "docs", "PRD.md"))) {
       artifacts.push("docs/PRD.md");
killedBy: changeRequestHandler breaking=false is preserved in the written yaml
statusReason: The "path" argument must be of type string. Received undefined

[Killed] ConditionalExpression
src/tools/change-request.ts:99:7
   }
 
   // Always include PRD if spec-change type
-  if (type === "spec-change" && !artifacts.includes("docs/PRD.md")) {
+  if (false) {
     if (existsSync(join(projectDir, "docs", "PRD.md"))) {
       artifacts.push("docs/PRD.md");
killedBy: changeRequestHandler creates the changes directory and writes a yaml file
statusReason: expected [ …(2) ] to have a length of 1 but got 2

[Survived] ConditionalExpression
src/tools/change-request.ts:100:9
 
   // Always include PRD if spec-change type
   if (type === "spec-change" && !artifacts.includes("docs/PRD.md")) {
-    if (existsSync(join(projectDir, "docs", "PRD.md"))) {
+    if (true) {
       artifacts.push("docs/PRD.md");
     }

[Survived] ConditionalExpression
src/tools/change-request.ts:100:9
 
   // Always include PRD if spec-change type
   if (type === "spec-change" && !artifacts.includes("docs/PRD.md")) {
-    if (existsSync(join(projectDir, "docs", "PRD.md"))) {
+    if (false) {
       artifacts.push("docs/PRD.md");
     }

[Killed] ConditionalExpression
src/tools/change-request.ts:106:7
   }
 
   // ADR supersession
-  if (type === "adr-supersession" || words.some((w) => ["adr", "decision", "architecture"].includes(w))) {
+  if (false) {
     const adrDir = join(projectDir, "docs", "adrs");
     if (existsSync(adrDir)) {
killedBy: detectAffectedArtifacts includes docs/adrs/ for adr-supersession type
statusReason: expected [] to include 'docs/adrs/'

[Killed] ConditionalExpression
src/tools/change-request.ts:106:7
   }
 
   // ADR supersession
-  if (type === "adr-supersession" || words.some((w) => ["adr", "decision", "architecture"].includes(w))) {
+  if (false || words.some((w) => ["adr", "decision", "architecture"].includes(w))) {
     const adrDir = join(projectDir, "docs", "adrs");
     if (existsSync(adrDir)) {
killedBy: detectAffectedArtifacts adds docs/adrs/ for adr-supersession type even without adr keywords in title
statusReason: expected [] to include 'docs/adrs/'

[Killed] ConditionalExpression
src/tools/change-request.ts:108:9
   // ADR supersession
   if (type === "adr-supersession" || words.some((w) => ["adr", "decision", "architecture"].includes(w))) {
     const adrDir = join(projectDir, "docs", "adrs");
-    if (existsSync(adrDir)) {
+    if (false) {
       artifacts.push("docs/adrs/");
     }
killedBy: detectAffectedArtifacts includes docs/adrs/ for adr-supersession type
statusReason: expected [] to include 'docs/adrs/'

[Killed] ConditionalExpression
src/tools/change-request.ts:108:9
   // ADR supersession
   if (type === "adr-supersession" || words.some((w) => ["adr", "decision", "architecture"].includes(w))) {
     const adrDir = join(projectDir, "docs", "adrs");
-    if (existsSync(adrDir)) {
+    if (true) {
       artifacts.push("docs/adrs/");
     }
killedBy: detectAffectedArtifacts does not include files that do not exist
statusReason: expected [ 'docs/adrs/' ] to deeply equal []

[Killed] ConditionalExpression
src/tools/change-request.ts:114:7
   }
 
   // Breaking API — flag schema and contract files
-  if (type === "breaking-api") {
+  if (false) {
     for (const p of ["docs/schema.md", "openapi.yaml", "openapi.json"]) {
       if (existsSync(join(projectDir, p))) artifacts.push(p);
killedBy: detectAffectedArtifacts includes openapi.yaml for breaking-api type when present
statusReason: expected [] to include 'openapi.yaml'

[Killed] BlockStatement
src/tools/change-request.ts:114:32
   }
 
   // Breaking API — flag schema and contract files
-  if (type === "breaking-api") {
-    for (const p of ["docs/schema.md", "openapi.yaml", "openapi.json"]) {
-      if (existsSync(join(projectDir, p))) artifacts.push(p);
-    }
-  }
+  if (type === "breaking-api") {}
 
   return [...new Set(artifacts)];
killedBy: detectAffectedArtifacts includes openapi.yaml for breaking-api type when present
statusReason: expected [] to include 'openapi.yaml'

[Killed] BlockStatement
src/tools/change-request.ts:115:73
 
   // Breaking API — flag schema and contract files
   if (type === "breaking-api") {
-    for (const p of ["docs/schema.md", "openapi.yaml", "openapi.json"]) {
-      if (existsSync(join(projectDir, p))) artifacts.push(p);
-    }
+    for (const p of ["docs/schema.md", "openapi.yaml", "openapi.json"]) {}
   }
 
killedBy: detectAffectedArtifacts includes openapi.yaml for breaking-api type when present
statusReason: expected [] to include 'openapi.yaml'

[Killed] ArrayDeclaration
src/tools/change-request.ts:115:21
 
   // Breaking API — flag schema and contract files
   if (type === "breaking-api") {
-    for (const p of ["docs/schema.md", "openapi.yaml", "openapi.json"]) {
+    for (const p of []) {
       if (existsSync(join(projectDir, p))) artifacts.push(p);
     }
killedBy: detectAffectedArtifacts includes openapi.yaml for breaking-api type when present
statusReason: expected [] to include 'openapi.yaml'

[Killed] ConditionalExpression
src/tools/change-request.ts:116:11
   // Breaking API — flag schema and contract files
   if (type === "breaking-api") {
     for (const p of ["docs/schema.md", "openapi.yaml", "openapi.json"]) {
-      if (existsSync(join(projectDir, p))) artifacts.push(p);
+      if (false) artifacts.push(p);
     }
   }
killedBy: detectAffectedArtifacts includes openapi.yaml for breaking-api type when present
statusReason: expected [] to include 'openapi.yaml'

[Survived] ConditionalExpression
src/tools/change-request.ts:116:11
   // Breaking API — flag schema and contract files
   if (type === "breaking-api") {
     for (const p of ["docs/schema.md", "openapi.yaml", "openapi.json"]) {
-      if (existsSync(join(projectDir, p))) artifacts.push(p);
+      if (true) artifacts.push(p);
     }
   }

[Killed] BooleanLiteral
src/tools/change-request.ts:129:7
   const gates: string[] = [];
 
   const gateDir = join(projectDir, ".forgecraft", "gates", "active");
-  if (!existsSync(gateDir)) return gates;
+  if (existsSync(gateDir)) return gates;
 
   const allGateIds = readdirSync(gateDir)
killedBy: detectRequiredGates returns empty when gate dir does not exist
statusReason: ENOENT: no such file or directory, scandir 'C:\Users\JC\AppData\Local\Temp\chg-test-1776709610605\.forgecraft\gates\active'

[Killed] ConditionalExpression
src/tools/change-request.ts:129:7
   const gates: string[] = [];
 
   const gateDir = join(projectDir, ".forgecraft", "gates", "active");
-  if (!existsSync(gateDir)) return gates;
+  if (true) return gates;
 
   const allGateIds = readdirSync(gateDir)
killedBy: detectRequiredGates includes l2-* gates from active dir
statusReason: expected [] to include 'l2-coverage'

[Survived] MethodExpression
src/tools/change-request.ts:131:22
   const gateDir = join(projectDir, ".forgecraft", "gates", "active");
   if (!existsSync(gateDir)) return gates;
 
-  const allGateIds = readdirSync(gateDir)
-    .filter((f) => f.endsWith(".yaml"))
-    .map((f) => {
-      try {
-        const text = readFileSync(join(gateDir, f), "utf-8");
-        return /^id:\s*(.+)$/m.exec(text)?.[1]?.trim() ?? "";
-      } catch {
-        return "";
-      }
-    })
-    .filter(Boolean);
+  const allGateIds = readdirSync(gateDir).filter(f => f.endsWith(".yaml")).map(f => {
+  try {
+    const text = readFileSync(join(gateDir, f), "utf-8");
+    return /^id:\s*(.+)$/m.exec(text)?.[1]?.trim() ?? "";
+  } catch {
+    return "";
+  }
+});
 
   // Always include L2 coverage gate if present

[Survived] MethodExpression
src/tools/change-request.ts:131:22
   const gateDir = join(projectDir, ".forgecraft", "gates", "active");
   if (!existsSync(gateDir)) return gates;
 
-  const allGateIds = readdirSync(gateDir)
-    .filter((f) => f.endsWith(".yaml"))
+  const allGateIds = readdirSync(gateDir)
     .map((f) => {
       try {

[Killed] ArrowFunction
src/tools/change-request.ts:132:13
   if (!existsSync(gateDir)) return gates;
 
   const allGateIds = readdirSync(gateDir)
-    .filter((f) => f.endsWith(".yaml"))
+    .filter(() => undefined)
     .map((f) => {
       try {
killedBy: detectRequiredGates includes l2-* gates from active dir
statusReason: expected [] to include 'l2-coverage'

[Killed] MethodExpression
src/tools/change-request.ts:132:20
   if (!existsSync(gateDir)) return gates;
 
   const allGateIds = readdirSync(gateDir)
-    .filter((f) => f.endsWith(".yaml"))
+    .filter((f) => f.startsWith(".yaml"))
     .map((f) => {
       try {
killedBy: detectRequiredGates includes l2-* gates from active dir
statusReason: expected [] to include 'l2-coverage'

[Killed] BlockStatement
src/tools/change-request.ts:133:17
 
   const allGateIds = readdirSync(gateDir)
     .filter((f) => f.endsWith(".yaml"))
-    .map((f) => {
-      try {
-        const text = readFileSync(join(gateDir, f), "utf-8");
-        return /^id:\s*(.+)$/m.exec(text)?.[1]?.trim() ?? "";
-      } catch {
-        return "";
-      }
-    })
+    .map((f) => {})
     .filter(Boolean);
 
killedBy: detectRequiredGates includes l2-* gates from active dir
statusReason: expected [] to include 'l2-coverage'

[Killed] BlockStatement
src/tools/change-request.ts:134:11
   const allGateIds = readdirSync(gateDir)
     .filter((f) => f.endsWith(".yaml"))
     .map((f) => {
-      try {
-        const text = readFileSync(join(gateDir, f), "utf-8");
-        return /^id:\s*(.+)$/m.exec(text)?.[1]?.trim() ?? "";
-      } catch {
+      try {} catch {
         return "";
       }
killedBy: detectRequiredGates includes l2-* gates from active dir
statusReason: expected [] to include 'l2-coverage'

[Killed] LogicalOperator
src/tools/change-request.ts:136:16
     .map((f) => {
       try {
         const text = readFileSync(join(gateDir, f), "utf-8");
-        return /^id:\s*(.+)$/m.exec(text)?.[1]?.trim() ?? "";
+        return /^id:\s*(.+)$/m.exec(text)?.[1]?.trim() && "";
       } catch {
         return "";
killedBy: detectRequiredGates includes l2-* gates from active dir
statusReason: expected [] to include 'l2-coverage'

[Survived] OptionalChaining
src/tools/change-request.ts:136:16
     .map((f) => {
       try {
         const text = readFileSync(join(gateDir, f), "utf-8");
-        return /^id:\s*(.+)$/m.exec(text)?.[1]?.trim() ?? "";
+        return /^id:\s*(.+)$/m.exec(text)[1]?.trim() ?? "";
       } catch {
         return "";

[NoCoverage] BlockStatement
src/tools/change-request.ts:137:15
       try {
         const text = readFileSync(join(gateDir, f), "utf-8");
         return /^id:\s*(.+)$/m.exec(text)?.[1]?.trim() ?? "";
-      } catch {
-        return "";
-      }
+      } catch {}
     })
     .filter(Boolean);

[Killed] BlockStatement
src/tools/change-request.ts:144:32
     .filter(Boolean);
 
   // Always include L2 coverage gate if present
-  for (const id of allGateIds) {
-    if (id.startsWith("l2-") || id === "contract-testing-required") {
-      gates.push(id);
-    }
-  }
+  for (const id of allGateIds) {}
 
   // Breaking API changes must pass schema and contract gates
killedBy: detectRequiredGates includes l2-* gates from active dir
statusReason: expected [] to include 'l2-coverage'

[Killed] BlockStatement
src/tools/change-request.ts:145:69
 
   // Always include L2 coverage gate if present
   for (const id of allGateIds) {
-    if (id.startsWith("l2-") || id === "contract-testing-required") {
-      gates.push(id);
-    }
+    if (id.startsWith("l2-") || id === "contract-testing-required") {}
   }
 
killedBy: detectRequiredGates includes l2-* gates from active dir
statusReason: expected [] to include 'l2-coverage'

[Killed] LogicalOperator
src/tools/change-request.ts:145:9
 
   // Always include L2 coverage gate if present
   for (const id of allGateIds) {
-    if (id.startsWith("l2-") || id === "contract-testing-required") {
+    if (id.startsWith("l2-") && id === "contract-testing-required") {
       gates.push(id);
     }
killedBy: detectRequiredGates includes l2-* gates from active dir
statusReason: expected [] to include 'l2-coverage'

[Killed] BlockStatement
src/tools/change-request.ts:151:44
   }
 
   // Breaking API changes must pass schema and contract gates
-  if (breaking || type === "breaking-api") {
-    for (const id of allGateIds) {
-      if (id.includes("schema") || id.includes("contract")) {
-        if (!gates.includes(id)) gates.push(id);
-      }
-    }
-  }
+  if (breaking || type === "breaking-api") {}
 
   return gates;
killedBy: detectRequiredGates adds schema gates for breaking-api type
statusReason: expected [] to include 'schema-validation'

[Killed] ConditionalExpression
src/tools/change-request.ts:151:7
   }
 
   // Breaking API changes must pass schema and contract gates
-  if (breaking || type === "breaking-api") {
+  if (false) {
     for (const id of allGateIds) {
       if (id.includes("schema") || id.includes("contract")) {
killedBy: detectRequiredGates adds schema gates for breaking-api type
statusReason: expected [] to include 'schema-validation'

[Killed] BlockStatement
src/tools/change-request.ts:152:34
 
   // Breaking API changes must pass schema and contract gates
   if (breaking || type === "breaking-api") {
-    for (const id of allGateIds) {
-      if (id.includes("schema") || id.includes("contract")) {
-        if (!gates.includes(id)) gates.push(id);
-      }
-    }
+    for (const id of allGateIds) {}
   }
 
killedBy: detectRequiredGates adds schema gates for breaking-api type
statusReason: expected [] to include 'schema-validation'

[Killed] BlockStatement
src/tools/change-request.ts:153:61
   // Breaking API changes must pass schema and contract gates
   if (breaking || type === "breaking-api") {
     for (const id of allGateIds) {
-      if (id.includes("schema") || id.includes("contract")) {
-        if (!gates.includes(id)) gates.push(id);
-      }
+      if (id.includes("schema") || id.includes("contract")) {}
     }
   }
killedBy: detectRequiredGates adds schema gates for breaking-api type
statusReason: expected [] to include 'schema-validation'

[Killed] ConditionalExpression
src/tools/change-request.ts:153:11
   // Breaking API changes must pass schema and contract gates
   if (breaking || type === "breaking-api") {
     for (const id of allGateIds) {
-      if (id.includes("schema") || id.includes("contract")) {
+      if (false) {
         if (!gates.includes(id)) gates.push(id);
       }
killedBy: detectRequiredGates adds schema gates for breaking-api type
statusReason: expected [] to include 'schema-validation'

[Killed] ConditionalExpression
src/tools/change-request.ts:154:13
   if (breaking || type === "breaking-api") {
     for (const id of allGateIds) {
       if (id.includes("schema") || id.includes("contract")) {
-        if (!gates.includes(id)) gates.push(id);
+        if (true) gates.push(id);
       }
     }
killedBy: detectRequiredGates does not duplicate gates
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/tools/change-request.ts:154:13
   if (breaking || type === "breaking-api") {
     for (const id of allGateIds) {
       if (id.includes("schema") || id.includes("contract")) {
-        if (!gates.includes(id)) gates.push(id);
+        if (false) gates.push(id);
       }
     }
killedBy: detectRequiredGates adds schema gates for breaking-api type
statusReason: expected [] to include 'schema-validation'

[Survived] ArrowFunction
src/tools/change-request.ts:174:43
     `breaking: ${record.breaking}`,
     ``,
     `description: >`,
-    ...record.description.split("\n").map((l) => `  ${l}`),
+    ...record.description.split("\n").map(() => undefined),
     ``,
   ];

[Killed] BlockStatement
src/tools/change-request.ts:178:32
     ``,
   ];
 
-  if (record.breaking_details) {
-    lines.push(`breaking_details: "${record.breaking_details.replace(/"/g, '\\"')}"`, ``);
-  }
+  if (record.breaking_details) {}
 
   if (record.supersedes_adr) {
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips breaking_details
statusReason: expected undefined to be 'Removes /api/v1/users endpoint' // Object.is equality

[Killed] ConditionalExpression
src/tools/change-request.ts:178:7
     ``,
   ];
 
-  if (record.breaking_details) {
+  if (true) {
     lines.push(`breaking_details: "${record.breaking_details.replace(/"/g, '\\"')}"`, ``);
   }
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips a minimal record
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] ConditionalExpression
src/tools/change-request.ts:182:7
     lines.push(`breaking_details: "${record.breaking_details.replace(/"/g, '\\"')}"`, ``);
   }
 
-  if (record.supersedes_adr) {
+  if (false) {
     lines.push(`supersedes_adr: ${record.supersedes_adr}`, ``);
   }
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips supersedes_adr
statusReason: expected undefined to be 'ADR-0003' // Object.is equality

[Killed] BlockStatement
src/tools/change-request.ts:182:30
     lines.push(`breaking_details: "${record.breaking_details.replace(/"/g, '\\"')}"`, ``);
   }
 
-  if (record.supersedes_adr) {
-    lines.push(`supersedes_adr: ${record.supersedes_adr}`, ``);
-  }
+  if (record.supersedes_adr) {}
 
   lines.push(`affected_artifacts:`);
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips supersedes_adr
statusReason: expected undefined to be 'ADR-0003' // Object.is equality

[Killed] BlockStatement
src/tools/change-request.ts:187:46
   }
 
   lines.push(`affected_artifacts:`);
-  for (const a of record.affected_artifacts) {
-    lines.push(`  - ${a}`);
-  }
+  for (const a of record.affected_artifacts) {}
   lines.push(``);
 
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips affected_artifacts list
statusReason: expected [] to include 'docs/PRD.md'

[Killed] ConditionalExpression
src/tools/change-request.ts:193:7
   lines.push(``);
 
   lines.push(`required_gates:`);
-  if (record.required_gates.length === 0) {
+  if (false) {
     lines.push(`  []`);
   } else {
killedBy: serializeChangeRecord + parseChangeRecord round-trip serialized text has required_gates: [] for empty gates
statusReason: expected 'id: chg-2026-04-19-replace-jwt-middle…' to contain '[]'

[Killed] EqualityOperator
src/tools/change-request.ts:193:7
   lines.push(``);
 
   lines.push(`required_gates:`);
-  if (record.required_gates.length === 0) {
+  if (record.required_gates.length !== 0) {
     lines.push(`  []`);
   } else {
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips required_gates list
statusReason: expected [] to include 'l2-coverage'

[Killed] BlockStatement
src/tools/change-request.ts:195:10
   lines.push(`required_gates:`);
   if (record.required_gates.length === 0) {
     lines.push(`  []`);
-  } else {
-    for (const g of record.required_gates) {
-      lines.push(`  - ${g}`);
-    }
-  }
+  } else {}
   lines.push(``);
 
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips required_gates list
statusReason: expected [] to include 'l2-coverage'
