[Killed] BlockStatement
src/tools/change-request.ts:196:44
   if (record.required_gates.length === 0) {
     lines.push(`  []`);
   } else {
-    for (const g of record.required_gates) {
-      lines.push(`  - ${g}`);
-    }
+    for (const g of record.required_gates) {}
   }
   lines.push(``);
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips required_gates list
statusReason: expected [] to include 'l2-coverage'

[Killed] ArrowFunction
src/tools/change-request.ts:213:21
 
 export function parseChangeRecord(content: string, id: string): ChangeRecord | null {
   try {
-    const fieldRe = (key: string) =>
-      new RegExp(`^${key}:\\s*["']?(.+?)["']?\\s*$`, "m").exec(content)?.[1]?.trim() ?? "";
+    const fieldRe = () => undefined;
 
     const status = (fieldRe("status") as ChangeStatus) || "open";
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips a minimal record
statusReason: expected undefined to be 'Replace JWT middleware with Clerk SSO' // Object.is equality

[Killed] LogicalOperator
src/tools/change-request.ts:214:7
 export function parseChangeRecord(content: string, id: string): ChangeRecord | null {
   try {
     const fieldRe = (key: string) =>
-      new RegExp(`^${key}:\\s*["']?(.+?)["']?\\s*$`, "m").exec(content)?.[1]?.trim() ?? "";
+      new RegExp(`^${key}:\\s*["']?(.+?)["']?\\s*$`, "m").exec(content)?.[1]?.trim() && "";
 
     const status = (fieldRe("status") as ChangeStatus) || "open";
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips a minimal record
statusReason: expected '' to be 'Replace JWT middleware with Clerk SSO' // Object.is equality

[Killed] OptionalChaining
src/tools/change-request.ts:214:7
 export function parseChangeRecord(content: string, id: string): ChangeRecord | null {
   try {
     const fieldRe = (key: string) =>
-      new RegExp(`^${key}:\\s*["']?(.+?)["']?\\s*$`, "m").exec(content)?.[1]?.trim() ?? "";
+      new RegExp(`^${key}:\\s*["']?(.+?)["']?\\s*$`, "m").exec(content)[1]?.trim() ?? "";
 
     const status = (fieldRe("status") as ChangeStatus) || "open";
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips a minimal record
statusReason: expected null not to be null

[Killed] LogicalOperator
src/tools/change-request.ts:216:20
     const fieldRe = (key: string) =>
       new RegExp(`^${key}:\\s*["']?(.+?)["']?\\s*$`, "m").exec(content)?.[1]?.trim() ?? "";
 
-    const status = (fieldRe("status") as ChangeStatus) || "open";
+    const status = fieldRe("status") as ChangeStatus && "open";
     const type = (fieldRe("type") as ChangeType) || "spec-change";
     const title = fieldRe("title");
killedBy: getImplementingChanges returns only implementing-status records
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/tools/change-request.ts:216:20
     const fieldRe = (key: string) =>
       new RegExp(`^${key}:\\s*["']?(.+?)["']?\\s*$`, "m").exec(content)?.[1]?.trim() ?? "";
 
-    const status = (fieldRe("status") as ChangeStatus) || "open";
+    const status = true;
     const type = (fieldRe("type") as ChangeType) || "spec-change";
     const title = fieldRe("title");
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips a minimal record
statusReason: expected true to be 'open' // Object.is equality

[Killed] LogicalOperator
src/tools/change-request.ts:217:18
       new RegExp(`^${key}:\\s*["']?(.+?)["']?\\s*$`, "m").exec(content)?.[1]?.trim() ?? "";
 
     const status = (fieldRe("status") as ChangeStatus) || "open";
-    const type = (fieldRe("type") as ChangeType) || "spec-change";
+    const type = fieldRe("type") as ChangeType && "spec-change";
     const title = fieldRe("title");
     const created = fieldRe("created");
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips a minimal record
statusReason: expected 'spec-change' to be 'breaking-api' // Object.is equality

[Killed] ConditionalExpression
src/tools/change-request.ts:217:18
       new RegExp(`^${key}:\\s*["']?(.+?)["']?\\s*$`, "m").exec(content)?.[1]?.trim() ?? "";
 
     const status = (fieldRe("status") as ChangeStatus) || "open";
-    const type = (fieldRe("type") as ChangeType) || "spec-change";
+    const type = true;
     const title = fieldRe("title");
     const created = fieldRe("created");
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips a minimal record
statusReason: expected true to be 'breaking-api' // Object.is equality

[Killed] EqualityOperator
src/tools/change-request.ts:220:22
     const type = (fieldRe("type") as ChangeType) || "spec-change";
     const title = fieldRe("title");
     const created = fieldRe("created");
-    const breaking = fieldRe("breaking") === "true";
+    const breaking = fieldRe("breaking") !== "true";
     const breaking_details = fieldRe("breaking_details") || undefined;
     const supersedes_adr = fieldRe("supersedes_adr") || undefined;
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips a minimal record
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/tools/change-request.ts:220:22
     const type = (fieldRe("type") as ChangeType) || "spec-change";
     const title = fieldRe("title");
     const created = fieldRe("created");
-    const breaking = fieldRe("breaking") === "true";
+    const breaking = true;
     const breaking_details = fieldRe("breaking_details") || undefined;
     const supersedes_adr = fieldRe("supersedes_adr") || undefined;
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips breaking=false correctly
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/tools/change-request.ts:221:30
     const title = fieldRe("title");
     const created = fieldRe("created");
     const breaking = fieldRe("breaking") === "true";
-    const breaking_details = fieldRe("breaking_details") || undefined;
+    const breaking_details = false;
     const supersedes_adr = fieldRe("supersedes_adr") || undefined;
     const blocked_reason = fieldRe("blocked_reason") !== "~" ? fieldRe("blocked_reason") : undefined;
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips breaking_details
statusReason: expected false to be 'Removes /api/v1/users endpoint' // Object.is equality

[Killed] ConditionalExpression
src/tools/change-request.ts:221:30
     const title = fieldRe("title");
     const created = fieldRe("created");
     const breaking = fieldRe("breaking") === "true";
-    const breaking_details = fieldRe("breaking_details") || undefined;
+    const breaking_details = true;
     const supersedes_adr = fieldRe("supersedes_adr") || undefined;
     const blocked_reason = fieldRe("blocked_reason") !== "~" ? fieldRe("blocked_reason") : undefined;
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips breaking_details
statusReason: expected true to be 'Removes /api/v1/users endpoint' // Object.is equality

[Killed] LogicalOperator
src/tools/change-request.ts:222:28
     const created = fieldRe("created");
     const breaking = fieldRe("breaking") === "true";
     const breaking_details = fieldRe("breaking_details") || undefined;
-    const supersedes_adr = fieldRe("supersedes_adr") || undefined;
+    const supersedes_adr = fieldRe("supersedes_adr") && undefined;
     const blocked_reason = fieldRe("blocked_reason") !== "~" ? fieldRe("blocked_reason") : undefined;
     const verified_at = fieldRe("verified_at") !== "~" ? fieldRe("verified_at") : undefined;
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips supersedes_adr
statusReason: expected undefined to be 'ADR-0003' // Object.is equality

[Killed] ConditionalExpression
src/tools/change-request.ts:222:28
     const created = fieldRe("created");
     const breaking = fieldRe("breaking") === "true";
     const breaking_details = fieldRe("breaking_details") || undefined;
-    const supersedes_adr = fieldRe("supersedes_adr") || undefined;
+    const supersedes_adr = true;
     const blocked_reason = fieldRe("blocked_reason") !== "~" ? fieldRe("blocked_reason") : undefined;
     const verified_at = fieldRe("verified_at") !== "~" ? fieldRe("verified_at") : undefined;
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips supersedes_adr
statusReason: expected true to be 'ADR-0003' // Object.is equality

[Killed] EqualityOperator
src/tools/change-request.ts:223:28
     const breaking = fieldRe("breaking") === "true";
     const breaking_details = fieldRe("breaking_details") || undefined;
     const supersedes_adr = fieldRe("supersedes_adr") || undefined;
-    const blocked_reason = fieldRe("blocked_reason") !== "~" ? fieldRe("blocked_reason") : undefined;
+    const blocked_reason = fieldRe("blocked_reason") === "~" ? fieldRe("blocked_reason") : undefined;
     const verified_at = fieldRe("verified_at") !== "~" ? fieldRe("verified_at") : undefined;
     const closed_at = fieldRe("closed_at") !== "~" ? fieldRe("closed_at") : undefined;
killedBy: serializeChangeRecord + parseChangeRecord round-trip parseChangeRecord: blocked_reason is returned when not ~ in YAML
statusReason: expected undefined to be 'waiting for approval' // Object.is equality

[Killed] ConditionalExpression
src/tools/change-request.ts:223:28
     const breaking = fieldRe("breaking") === "true";
     const breaking_details = fieldRe("breaking_details") || undefined;
     const supersedes_adr = fieldRe("supersedes_adr") || undefined;
-    const blocked_reason = fieldRe("blocked_reason") !== "~" ? fieldRe("blocked_reason") : undefined;
+    const blocked_reason = false ? fieldRe("blocked_reason") : undefined;
     const verified_at = fieldRe("verified_at") !== "~" ? fieldRe("verified_at") : undefined;
     const closed_at = fieldRe("closed_at") !== "~" ? fieldRe("closed_at") : undefined;
killedBy: serializeChangeRecord + parseChangeRecord round-trip parseChangeRecord: blocked_reason is returned when not ~ in YAML
statusReason: expected undefined to be 'waiting for approval' // Object.is equality

[Killed] EqualityOperator
src/tools/change-request.ts:224:25
     const breaking_details = fieldRe("breaking_details") || undefined;
     const supersedes_adr = fieldRe("supersedes_adr") || undefined;
     const blocked_reason = fieldRe("blocked_reason") !== "~" ? fieldRe("blocked_reason") : undefined;
-    const verified_at = fieldRe("verified_at") !== "~" ? fieldRe("verified_at") : undefined;
+    const verified_at = fieldRe("verified_at") === "~" ? fieldRe("verified_at") : undefined;
     const closed_at = fieldRe("closed_at") !== "~" ? fieldRe("closed_at") : undefined;
 
killedBy: serializeChangeRecord + parseChangeRecord round-trip parseChangeRecord: verified_at is returned when not ~ in YAML
statusReason: expected undefined to be '2026-04-20' // Object.is equality

[Killed] ConditionalExpression
src/tools/change-request.ts:224:25
     const breaking_details = fieldRe("breaking_details") || undefined;
     const supersedes_adr = fieldRe("supersedes_adr") || undefined;
     const blocked_reason = fieldRe("blocked_reason") !== "~" ? fieldRe("blocked_reason") : undefined;
-    const verified_at = fieldRe("verified_at") !== "~" ? fieldRe("verified_at") : undefined;
+    const verified_at = true ? fieldRe("verified_at") : undefined;
     const closed_at = fieldRe("closed_at") !== "~" ? fieldRe("closed_at") : undefined;
 
killedBy: serializeChangeRecord + parseChangeRecord round-trip parseChangeRecord: verified_at is undefined when ~ in YAML
statusReason: expected '~' to be undefined

[Killed] ConditionalExpression
src/tools/change-request.ts:225:23
     const supersedes_adr = fieldRe("supersedes_adr") || undefined;
     const blocked_reason = fieldRe("blocked_reason") !== "~" ? fieldRe("blocked_reason") : undefined;
     const verified_at = fieldRe("verified_at") !== "~" ? fieldRe("verified_at") : undefined;
-    const closed_at = fieldRe("closed_at") !== "~" ? fieldRe("closed_at") : undefined;
+    const closed_at = false ? fieldRe("closed_at") : undefined;
 
     // Parse list fields
killedBy: serializeChangeRecord + parseChangeRecord round-trip parseChangeRecord: closed_at is returned when not ~ in YAML
statusReason: expected undefined to be '2026-04-20' // Object.is equality

[Killed] EqualityOperator
src/tools/change-request.ts:225:23
     const supersedes_adr = fieldRe("supersedes_adr") || undefined;
     const blocked_reason = fieldRe("blocked_reason") !== "~" ? fieldRe("blocked_reason") : undefined;
     const verified_at = fieldRe("verified_at") !== "~" ? fieldRe("verified_at") : undefined;
-    const closed_at = fieldRe("closed_at") !== "~" ? fieldRe("closed_at") : undefined;
+    const closed_at = fieldRe("closed_at") === "~" ? fieldRe("closed_at") : undefined;
 
     // Parse list fields
killedBy: serializeChangeRecord + parseChangeRecord round-trip parseChangeRecord: closed_at is returned when not ~ in YAML
statusReason: expected undefined to be '2026-04-20' // Object.is equality

[Killed] BlockStatement
src/tools/change-request.ts:228:50
     const closed_at = fieldRe("closed_at") !== "~" ? fieldRe("closed_at") : undefined;
 
     // Parse list fields
-    const parseList = (key: string): string[] => {
-      const match = new RegExp(`^${key}:\\n((?:\\s+-.+\\n?)+)`, "m").exec(content);
-      if (!match) return [];
-      return match[1]!
-        .split("\n")
-        .map((l) => l.replace(/^\s+-\s*/, "").trim())
-        .filter(Boolean);
-    };
+    const parseList = (key: string): string[] => {};
 
     const affected_artifacts = parseList("affected_artifacts");
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips affected_artifacts list
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
src/tools/change-request.ts:230:11
     // Parse list fields
     const parseList = (key: string): string[] => {
       const match = new RegExp(`^${key}:\\n((?:\\s+-.+\\n?)+)`, "m").exec(content);
-      if (!match) return [];
+      if (false) return [];
       return match[1]!
         .split("\n")
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips a minimal record
statusReason: expected null not to be null

[Killed] ConditionalExpression
src/tools/change-request.ts:230:11
     // Parse list fields
     const parseList = (key: string): string[] => {
       const match = new RegExp(`^${key}:\\n((?:\\s+-.+\\n?)+)`, "m").exec(content);
-      if (!match) return [];
+      if (true) return [];
       return match[1]!
         .split("\n")
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips affected_artifacts list
statusReason: expected [] to include 'docs/PRD.md'

[Killed] MethodExpression
src/tools/change-request.ts:231:14
     const parseList = (key: string): string[] => {
       const match = new RegExp(`^${key}:\\n((?:\\s+-.+\\n?)+)`, "m").exec(content);
       if (!match) return [];
-      return match[1]!
-        .split("\n")
-        .map((l) => l.replace(/^\s+-\s*/, "").trim())
-        .filter(Boolean);
+      return match[1]!.split("\n").map(l => l.replace(/^\s+-\s*/, "").trim());
     };
 
killedBy: listChangesHandler shows close_cycle block warning for implementing changes
statusReason: expected '## Changes\n\nNo change records found…' to contain 'close_cycle will be blocked'

[Killed] MethodExpression
src/tools/change-request.ts:233:21
       if (!match) return [];
       return match[1]!
         .split("\n")
-        .map((l) => l.replace(/^\s+-\s*/, "").trim())
+        .map((l) => l.replace(/^\s+-\s*/, ""))
         .filter(Boolean);
     };
killedBy: listChangesHandler marks a change created 8 days ago as stale
statusReason: expected '## Changes\n\nNo change records found…' to contain 'stale'

[Killed] ArrowFunction
src/tools/change-request.ts:233:14
       if (!match) return [];
       return match[1]!
         .split("\n")
-        .map((l) => l.replace(/^\s+-\s*/, "").trim())
+        .map(() => undefined)
         .filter(Boolean);
     };
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips affected_artifacts list
statusReason: expected [] to include 'docs/PRD.md'

[Killed] Regex
src/tools/change-request.ts:241:23
     const required_gates = parseList("required_gates");
 
     // Extract description (block scalar)
-    const descMatch = /^description:\s*>\n((?:\s{2}.+\n?)+)/m.exec(content);
+    const descMatch = /^description:\s*>\n((?:\s.+\n?)+)/m.exec(content);
     const description = descMatch
       ? descMatch[1]!.split("\n").map((l) => l.replace(/^\s{2}/, "")).join("\n").trim()
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips required_gates list
statusReason: ENOTEMPTY: directory not empty, rmdir 'C:\Users\JC\AppData\Local\Temp\chg-test-1776709622701\.forgecraft\changes'

[Survived] Regex
src/tools/change-request.ts:241:23
     const required_gates = parseList("required_gates");
 
     // Extract description (block scalar)
-    const descMatch = /^description:\s*>\n((?:\s{2}.+\n?)+)/m.exec(content);
+    const descMatch = /^description:\S*>\n((?:\s{2}.+\n?)+)/m.exec(content);
     const description = descMatch
       ? descMatch[1]!.split("\n").map((l) => l.replace(/^\s{2}/, "")).join("\n").trim()

[Killed] MethodExpression
src/tools/change-request.ts:243:9
     // Extract description (block scalar)
     const descMatch = /^description:\s*>\n((?:\s{2}.+\n?)+)/m.exec(content);
     const description = descMatch
-      ? descMatch[1]!.split("\n").map((l) => l.replace(/^\s{2}/, "")).join("\n").trim()
+      ? descMatch[1]!.split("\n").map(l => l.replace(/^\s{2}/, "")).join("\n")
       : "";
 
killedBy: listChangesHandler never marks closed or verified changes as stale regardless of age
statusReason: ENOENT: no such file or directory, scandir 'C:\Users\JC\AppData\Local\Temp\chg-test-1776709623413\.forgecraft\changes'

[Survived] ArrowFunction
src/tools/change-request.ts:243:39
     // Extract description (block scalar)
     const descMatch = /^description:\s*>\n((?:\s{2}.+\n?)+)/m.exec(content);
     const description = descMatch
-      ? descMatch[1]!.split("\n").map((l) => l.replace(/^\s{2}/, "")).join("\n").trim()
+      ? descMatch[1]!.split("\n").map(() => undefined).join("\n").trim()
       : "";
 

[NoCoverage] BlockStatement
src/tools/change-request.ts:262:11
       verified_at,
       closed_at,
     };
-  } catch {
-    return null;
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/tools/change-request.ts:271:56
 
 const CHANGES_DIR = ".forgecraft/changes";
 
-export function changesDir(projectDir: string): string {
-  return join(projectDir, CHANGES_DIR);
-}
+export function changesDir(projectDir: string): string {}
 
 export function loadAllChanges(projectDir: string): ChangeRecord[] {
killedBy: loadAllChanges returns parsed records from yaml files
statusReason: The "path" argument must be of type string or an instance of Buffer or URL. Received undefined

[Killed] BlockStatement
src/tools/change-request.ts:275:68
   return join(projectDir, CHANGES_DIR);
 }
 
-export function loadAllChanges(projectDir: string): ChangeRecord[] {
-  const dir = changesDir(projectDir);
-  if (!existsSync(dir)) return [];
-  return readdirSync(dir)
-    .filter((f) => f.endsWith(".yaml"))
-    .map((f) => {
-      try {
-        const content = readFileSync(join(dir, f), "utf-8");
-        const id = f.replace(/\.yaml$/, "");
-        return parseChangeRecord(content, id);
-      } catch {
-        return null;
-      }
-    })
-    .filter((r): r is ChangeRecord => r !== null);
-}
+export function loadAllChanges(projectDir: string): ChangeRecord[] {}
 
 /** Returns changes in implementing status — used by close_cycle gate. */
killedBy: loadAllChanges returns empty array when changes dir does not exist
statusReason: expected undefined to deeply equal []

[Killed] ConditionalExpression
src/tools/change-request.ts:277:7
 
 export function loadAllChanges(projectDir: string): ChangeRecord[] {
   const dir = changesDir(projectDir);
-  if (!existsSync(dir)) return [];
+  if (false) return [];
   return readdirSync(dir)
     .filter((f) => f.endsWith(".yaml"))
killedBy: loadAllChanges returns empty array when changes dir does not exist
statusReason: ENOENT: no such file or directory, scandir 'C:\Users\JC\AppData\Local\Temp\chg-test-1776709624560\.forgecraft\changes'

[Killed] ConditionalExpression
src/tools/change-request.ts:277:7
 
 export function loadAllChanges(projectDir: string): ChangeRecord[] {
   const dir = changesDir(projectDir);
-  if (!existsSync(dir)) return [];
+  if (true) return [];
   return readdirSync(dir)
     .filter((f) => f.endsWith(".yaml"))
killedBy: loadAllChanges returns parsed records from yaml files
statusReason: expected [] to have a length of 1 but got +0

[Killed] MethodExpression
src/tools/change-request.ts:278:10
 export function loadAllChanges(projectDir: string): ChangeRecord[] {
   const dir = changesDir(projectDir);
   if (!existsSync(dir)) return [];
-  return readdirSync(dir)
-    .filter((f) => f.endsWith(".yaml"))
+  return readdirSync(dir)
     .map((f) => {
       try {
killedBy: loadAllChanges skips non-yaml files
statusReason: expected [ { id: 'README.md', …(13) } ] to deeply equal []

[Survived] MethodExpression
src/tools/change-request.ts:278:10
 export function loadAllChanges(projectDir: string): ChangeRecord[] {
   const dir = changesDir(projectDir);
   if (!existsSync(dir)) return [];
-  return readdirSync(dir)
-    .filter((f) => f.endsWith(".yaml"))
-    .map((f) => {
-      try {
-        const content = readFileSync(join(dir, f), "utf-8");
-        const id = f.replace(/\.yaml$/, "");
-        return parseChangeRecord(content, id);
-      } catch {
-        return null;
-      }
-    })
-    .filter((r): r is ChangeRecord => r !== null);
+  return readdirSync(dir).filter(f => f.endsWith(".yaml")).map(f => {
+  try {
+    const content = readFileSync(join(dir, f), "utf-8");
+    const id = f.replace(/\.yaml$/, "");
+    return parseChangeRecord(content, id);
+  } catch {
+    return null;
+  }
+});
 }
 

[Killed] MethodExpression
src/tools/change-request.ts:279:20
   const dir = changesDir(projectDir);
   if (!existsSync(dir)) return [];
   return readdirSync(dir)
-    .filter((f) => f.endsWith(".yaml"))
+    .filter((f) => f.startsWith(".yaml"))
     .map((f) => {
       try {
killedBy: loadAllChanges returns parsed records from yaml files
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/tools/change-request.ts:279:13
   const dir = changesDir(projectDir);
   if (!existsSync(dir)) return [];
   return readdirSync(dir)
-    .filter((f) => f.endsWith(".yaml"))
+    .filter(() => undefined)
     .map((f) => {
       try {
killedBy: loadAllChanges returns parsed records from yaml files
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/tools/change-request.ts:280:17
   if (!existsSync(dir)) return [];
   return readdirSync(dir)
     .filter((f) => f.endsWith(".yaml"))
-    .map((f) => {
-      try {
-        const content = readFileSync(join(dir, f), "utf-8");
-        const id = f.replace(/\.yaml$/, "");
-        return parseChangeRecord(content, id);
-      } catch {
-        return null;
-      }
-    })
+    .map((f) => {})
     .filter((r): r is ChangeRecord => r !== null);
 }
killedBy: loadAllChanges returns parsed records from yaml files
statusReason: Cannot read properties of undefined (reading 'title')

[Killed] BlockStatement
src/tools/change-request.ts:281:11
   return readdirSync(dir)
     .filter((f) => f.endsWith(".yaml"))
     .map((f) => {
-      try {
-        const content = readFileSync(join(dir, f), "utf-8");
-        const id = f.replace(/\.yaml$/, "");
-        return parseChangeRecord(content, id);
-      } catch {
+      try {} catch {
         return null;
       }
killedBy: loadAllChanges returns parsed records from yaml files
statusReason: Cannot read properties of undefined (reading 'title')

[NoCoverage] BlockStatement
src/tools/change-request.ts:285:15
         const content = readFileSync(join(dir, f), "utf-8");
         const id = f.replace(/\.yaml$/, "");
         return parseChangeRecord(content, id);
-      } catch {
-        return null;
-      }
+      } catch {}
     })
     .filter((r): r is ChangeRecord => r !== null);

[Killed] ArrowFunction
src/tools/change-request.ts:289:13
         return null;
       }
     })
-    .filter((r): r is ChangeRecord => r !== null);
+    .filter(() => undefined);
 }
 
killedBy: loadAllChanges returns parsed records from yaml files
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/tools/change-request.ts:289:39
         return null;
       }
     })
-    .filter((r): r is ChangeRecord => r !== null);
+    .filter((r): r is ChangeRecord => false);
 }
 
killedBy: loadAllChanges returns parsed records from yaml files
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/tools/change-request.ts:293:76
 }
 
 /** Returns changes in implementing status — used by close_cycle gate. */
-export function getImplementingChanges(projectDir: string): ChangeRecord[] {
-  return loadAllChanges(projectDir).filter((c) => c.status === "implementing");
-}
+export function getImplementingChanges(projectDir: string): ChangeRecord[] {}
 
 // ── Handlers ──────────────────────────────────────────────────────────
killedBy: getImplementingChanges returns only implementing-status records
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
src/tools/change-request.ts:294:51
 
 /** Returns changes in implementing status — used by close_cycle gate. */
 export function getImplementingChanges(projectDir: string): ChangeRecord[] {
-  return loadAllChanges(projectDir).filter((c) => c.status === "implementing");
+  return loadAllChanges(projectDir).filter((c) => false);
 }
 
killedBy: getImplementingChanges returns only implementing-status records
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/tools/change-request.ts:294:51
 
 /** Returns changes in implementing status — used by close_cycle gate. */
 export function getImplementingChanges(projectDir: string): ChangeRecord[] {
-  return loadAllChanges(projectDir).filter((c) => c.status === "implementing");
+  return loadAllChanges(projectDir).filter((c) => true);
 }
 
killedBy: getImplementingChanges returns only implementing-status records
statusReason: expected [ { id: 'chg-closed', …(13) }, …(2) ] to have a length of 1 but got 3

[Killed] MethodExpression
src/tools/change-request.ts:301:16
 
 export async function changeRequestHandler(args: ChangeRequestInput): Promise<ToolResult> {
   const projectDir = resolve(args.project_dir);
-  const date = new Date().toISOString().slice(0, 10);
+  const date = new Date().toISOString();
   const id = slugify(args.title, date);
 
killedBy: changeRequestHandler creates the changes directory and writes a yaml file
statusReason: ENOENT: no such file or directory, open 'C:\Users\JC\AppData\Local\Temp\chg-test-1776709626981\.forgecraft\changes\chg-2026-04-20T18:27:06.982Z-replace-jwt-middleware.yaml'

[Killed] EqualityOperator
src/tools/change-request.ts:305:32
   const id = slugify(args.title, date);
 
   const affectedArtifacts =
-    args.affected_artifacts && args.affected_artifacts.length > 0
+    args.affected_artifacts && args.affected_artifacts.length <= 0
       ? args.affected_artifacts
       : detectAffectedArtifacts(projectDir, args.title, args.description, args.type);
killedBy: changeRequestHandler uses provided affected_artifacts over auto-detection
statusReason: expected '## Change Request Opened\n\n**ID:** `…' to contain 'custom/path.md'

[Killed] LogicalOperator
src/tools/change-request.ts:305:5
   const id = slugify(args.title, date);
 
   const affectedArtifacts =
-    args.affected_artifacts && args.affected_artifacts.length > 0
+    args.affected_artifacts || args.affected_artifacts.length > 0
       ? args.affected_artifacts
       : detectAffectedArtifacts(projectDir, args.title, args.description, args.type);
killedBy: changeRequestHandler creates the changes directory and writes a yaml file
statusReason: Cannot read properties of undefined (reading 'length')

[Survived] BooleanLiteral
src/tools/change-request.ts:312:22
   const requiredGates = detectRequiredGates(
     projectDir,
     args.type,
-    args.breaking ?? false,
+    args.breaking ?? true,
   );
 

[Survived] LogicalOperator
src/tools/change-request.ts:312:5
   const requiredGates = detectRequiredGates(
     projectDir,
     args.type,
-    args.breaking ?? false,
+    args.breaking && false,
   );
 

[Killed] LogicalOperator
src/tools/change-request.ts:322:15
     type: args.type,
     created: date,
     description: args.description,
-    breaking: args.breaking ?? false,
+    breaking: args.breaking && false,
     breaking_details: args.breaking_details,
     supersedes_adr: args.supersedes_adr,
killedBy: changeRequestHandler breaking defaults to false when not provided
statusReason: expected 'id: chg-2026-04-20-non-breaking-chang…' to contain 'breaking: false'

[Killed] BooleanLiteral
src/tools/change-request.ts:322:32
     type: args.type,
     created: date,
     description: args.description,
-    breaking: args.breaking ?? false,
+    breaking: args.breaking ?? true,
     breaking_details: args.breaking_details,
     supersedes_adr: args.supersedes_adr,
killedBy: changeRequestHandler breaking defaults to false when not provided
statusReason: expected 'id: chg-2026-04-20-non-breaking-chang…' to contain 'breaking: false'
