[Killed] BooleanLiteral
src/tools/change-request.ts:330:31
   };
 
   const dir = changesDir(projectDir);
-  mkdirSync(dir, { recursive: true });
+  mkdirSync(dir, { recursive: false });
   writeFileSync(join(dir, `${id}.yaml`), serializeChangeRecord(record), "utf-8");
 
killedBy: changeRequestHandler creates the changes directory and writes a yaml file
statusReason: ENOENT: no such file or directory, mkdir 'C:\Users\JC\AppData\Local\Temp\chg-test-1776709628302\.forgecraft\changes'

[Killed] ConditionalExpression
src/tools/change-request.ts:343:7
     ``,
   ];
 
-  if (record.breaking_details) {
+  if (false) {
     lines.push(`> ⚠️ **Breaking:** ${record.breaking_details}`, ``);
   }
killedBy: changeRequestHandler shows breaking warning when breaking=true
statusReason: expected '## Change Request Opened\n\n**ID:** `…' to contain 'Removes /api/v1/auth'

[Killed] BlockStatement
src/tools/change-request.ts:343:32
     ``,
   ];
 
-  if (record.breaking_details) {
-    lines.push(`> ⚠️ **Breaking:** ${record.breaking_details}`, ``);
-  }
+  if (record.breaking_details) {}
 
   if (record.supersedes_adr) {
killedBy: changeRequestHandler shows breaking warning when breaking=true
statusReason: expected '## Change Request Opened\n\n**ID:** `…' to contain 'Removes /api/v1/auth'

[Killed] BlockStatement
src/tools/change-request.ts:347:30
     lines.push(`> ⚠️ **Breaking:** ${record.breaking_details}`, ``);
   }
 
-  if (record.supersedes_adr) {
-    lines.push(`> Supersedes: \`${record.supersedes_adr}\` — update that ADR's status to Superseded.`, ``);
-  }
+  if (record.supersedes_adr) {}
 
   lines.push(`### Affected Artifacts`, ``);
killedBy: changeRequestHandler shows supersedes_adr notice
statusReason: expected '## Change Request Opened\n\n**ID:** `…' to contain 'ADR-0002'

[Killed] BlockStatement
src/tools/change-request.ts:352:46
   }
 
   lines.push(`### Affected Artifacts`, ``);
-  for (const a of record.affected_artifacts) {
-    lines.push(`- \`${a}\``);
-  }
+  for (const a of record.affected_artifacts) {}
   lines.push(``);
 
killedBy: changeRequestHandler uses provided affected_artifacts over auto-detection
statusReason: expected '## Change Request Opened\n\n**ID:** `…' to contain 'custom/path.md'

[Killed] EqualityOperator
src/tools/change-request.ts:357:7
   }
   lines.push(``);
 
-  if (record.required_gates.length > 0) {
+  if (record.required_gates.length <= 0) {
     lines.push(`### Required Gates (must pass before \`close_cycle\`)`, ``);
     for (const g of record.required_gates) {
killedBy: changeRequestHandler output includes required gates section when gates are non-empty
statusReason: expected '## Change Request Opened\n\n**ID:** `…' to contain 'Required Gates'

[Killed] ConditionalExpression
src/tools/change-request.ts:357:7
   }
   lines.push(``);
 
-  if (record.required_gates.length > 0) {
+  if (false) {
     lines.push(`### Required Gates (must pass before \`close_cycle\`)`, ``);
     for (const g of record.required_gates) {
killedBy: changeRequestHandler output includes required gates section when gates are non-empty
statusReason: expected '## Change Request Opened\n\n**ID:** `…' to contain 'Required Gates'

[Killed] BlockStatement
src/tools/change-request.ts:359:44
 
   if (record.required_gates.length > 0) {
     lines.push(`### Required Gates (must pass before \`close_cycle\`)`, ``);
-    for (const g of record.required_gates) {
-      lines.push(`- [ ] \`${g}\``);
-    }
+    for (const g of record.required_gates) {}
     lines.push(``);
   }
killedBy: changeRequestHandler output includes required gates section when gates are non-empty
statusReason: expected '## Change Request Opened\n\n**ID:** `…' to contain 'l2-coverage'

[Killed] ObjectLiteral
src/tools/change-request.ts:377:22
     `_Written to \`.forgecraft/changes/${id}.yaml\`_`,
   );
 
-  return { content: [{ type: "text", text: lines.join("\n") }] };
+  return { content: [{}] };
 }
 
killedBy: changeRequestHandler creates the changes directory and writes a yaml file
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ArrayDeclaration
src/tools/change-request.ts:377:21
     `_Written to \`.forgecraft/changes/${id}.yaml\`_`,
   );
 
-  return { content: [{ type: "text", text: lines.join("\n") }] };
+  return { content: [] };
 }
 
killedBy: changeRequestHandler creates the changes directory and writes a yaml file
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] LogicalOperator
src/tools/change-request.ts:382:24
 
 export async function listChangesHandler(args: ListChangesInput): Promise<ToolResult> {
   const projectDir = resolve(args.project_dir);
-  const filterStatus = args.status ?? "all";
+  const filterStatus = args.status && "all";
   const all = loadAllChanges(projectDir);
 
killedBy: listChangesHandler returns 'no records' message when changes dir is empty
statusReason: expected '## Changes\n\nNo changes with status …' to contain 'No change records found'

[Killed] ConditionalExpression
src/tools/change-request.ts:386:5
   const all = loadAllChanges(projectDir);
 
   const filtered =
-    filterStatus === "all"
+    false
       ? all
       : all.filter((c) => c.status === filterStatus);
killedBy: listChangesHandler lists all changes grouped by status
statusReason: expected '## Changes\n\nNo change records found…' to contain '2 total'

[Killed] EqualityOperator
src/tools/change-request.ts:386:5
   const all = loadAllChanges(projectDir);
 
   const filtered =
-    filterStatus === "all"
+    filterStatus !== "all"
       ? all
       : all.filter((c) => c.status === filterStatus);
killedBy: listChangesHandler lists all changes grouped by status
statusReason: expected '## Changes\n\nNo change records found…' to contain '2 total'

[Killed] MethodExpression
src/tools/change-request.ts:388:9
   const filtered =
     filterStatus === "all"
       ? all
-      : all.filter((c) => c.status === filterStatus);
+      : all;
 
   if (filtered.length === 0) {
killedBy: listChangesHandler filters by status when status param is provided
statusReason: expected '## Changes (2 total)\n\n### 📋 Open (…' to contain '1 total'

[Killed] EqualityOperator
src/tools/change-request.ts:388:27
   const filtered =
     filterStatus === "all"
       ? all
-      : all.filter((c) => c.status === filterStatus);
+      : all.filter((c) => c.status !== filterStatus);
 
   if (filtered.length === 0) {
killedBy: listChangesHandler filters by status when status param is provided
statusReason: expected '## Changes (1 total)\n\n### 📋 Open (…' not to contain 'chg-open'

[Killed] BlockStatement
src/tools/change-request.ts:390:30
       ? all
       : all.filter((c) => c.status === filterStatus);
 
-  if (filtered.length === 0) {
-    const msg =
-      filterStatus === "all"
-        ? "No change records found. Run `change_request` to open the first change."
-        : `No changes with status \`${filterStatus}\`.`;
-    return { content: [{ type: "text", text: `## Changes\n\n${msg}` }] };
-  }
+  if (filtered.length === 0) {}
 
   const today = new Date().toISOString().slice(0, 10);
killedBy: listChangesHandler returns 'no records' message when changes dir is empty
statusReason: expected '## Changes (0 total)\n' to contain 'No change records found'

[Killed] ConditionalExpression
src/tools/change-request.ts:390:7
       ? all
       : all.filter((c) => c.status === filterStatus);
 
-  if (filtered.length === 0) {
+  if (false) {
     const msg =
       filterStatus === "all"
killedBy: listChangesHandler returns 'no records' message when changes dir is empty
statusReason: expected '## Changes (0 total)\n' to contain 'No change records found'

[Killed] ConditionalExpression
src/tools/change-request.ts:392:7
 
   if (filtered.length === 0) {
     const msg =
-      filterStatus === "all"
+      true
         ? "No change records found. Run `change_request` to open the first change."
         : `No changes with status \`${filterStatus}\`.`;
killedBy: listChangesHandler shows 'no filter match' message when filtered status has no results
statusReason: expected '## Changes\n\nNo change records found…' to contain 'No changes with status'

[Killed] EqualityOperator
src/tools/change-request.ts:392:7
 
   if (filtered.length === 0) {
     const msg =
-      filterStatus === "all"
+      filterStatus !== "all"
         ? "No change records found. Run `change_request` to open the first change."
         : `No changes with status \`${filterStatus}\`.`;
killedBy: listChangesHandler returns 'no records' message when changes dir is empty
statusReason: expected '## Changes\n\nNo changes with status …' to contain 'No change records found'

[Killed] MethodExpression
src/tools/change-request.ts:398:17
     return { content: [{ type: "text", text: `## Changes\n\n${msg}` }] };
   }
 
-  const today = new Date().toISOString().slice(0, 10);
+  const today = new Date().toISOString();
 
   const statusGroups: Record<ChangeStatus, ChangeRecord[]> = {
killedBy: listChangesHandler does not mark a change created exactly 7 days ago as stale
statusReason: expected '## Changes (1 total)\n\n### 📋 Open (…' not to contain 'stale'

[Killed] BlockStatement
src/tools/change-request.ts:408:29
     closed: [],
   };
 
-  for (const c of filtered) {
-    statusGroups[c.status].push(c);
-  }
+  for (const c of filtered) {}
 
   const lines: string[] = [`## Changes (${filtered.length} total)`, ``];
killedBy: listChangesHandler lists all changes grouped by status
statusReason: expected '## Changes (2 total)\n' to contain 'Open'

[Killed] ArrayDeclaration
src/tools/change-request.ts:414:33
 
   const lines: string[] = [`## Changes (${filtered.length} total)`, ``];
 
-  const order: ChangeStatus[] = ["implementing", "blocked", "open", "verified", "closed"];
+  const order: ChangeStatus[] = [];
   for (const status of order) {
     const group = statusGroups[status];
killedBy: listChangesHandler lists all changes grouped by status
statusReason: expected '## Changes (2 total)\n\n### ⚠️ close_…' to contain 'Open'

[Killed] BlockStatement
src/tools/change-request.ts:415:31
   const lines: string[] = [`## Changes (${filtered.length} total)`, ``];
 
   const order: ChangeStatus[] = ["implementing", "blocked", "open", "verified", "closed"];
-  for (const status of order) {
-    const group = statusGroups[status];
-    if (group.length === 0) continue;
-
-    const emoji: Record<ChangeStatus, string> = {
-      implementing: "🔄",
-      blocked: "⛔",
-      open: "📋",
-      verified: "✅",
-      closed: "🔒",
-    };
-
-    lines.push(`### ${emoji[status]} ${status.charAt(0).toUpperCase() + status.slice(1)} (${group.length})`, ``);
-    lines.push(`| ID | Title | Type | Breaking | Gates | Created |`);
-    lines.push(`|---|---|---|---|---|---|`);
-
-    for (const c of group) {
-      const staleFlag = isStale(c, today) ? " ⚠️ stale" : "";
-      const breaking = c.breaking ? "⚠️ Yes" : "No";
-      const gates = c.required_gates.length > 0 ? c.required_gates.length.toString() : "—";
-      lines.push(`| \`${c.id}\` | ${c.title}${staleFlag} | ${c.type} | ${breaking} | ${gates} | ${c.created} |`);
-    }
-    lines.push(``);
-  }
+  for (const status of order) {}
 
   const implementing = statusGroups["implementing"];
killedBy: listChangesHandler lists all changes grouped by status
statusReason: expected '## Changes (2 total)\n\n### ⚠️ close_…' to contain 'Open'

[Killed] ConditionalExpression
src/tools/change-request.ts:417:9
   const order: ChangeStatus[] = ["implementing", "blocked", "open", "verified", "closed"];
   for (const status of order) {
     const group = statusGroups[status];
-    if (group.length === 0) continue;
+    if (true) continue;
 
     const emoji: Record<ChangeStatus, string> = {
killedBy: listChangesHandler lists all changes grouped by status
statusReason: expected '## Changes (2 total)\n\n### ⚠️ close_…' to contain 'Open'

[Killed] EqualityOperator
src/tools/change-request.ts:417:9
   const order: ChangeStatus[] = ["implementing", "blocked", "open", "verified", "closed"];
   for (const status of order) {
     const group = statusGroups[status];
-    if (group.length === 0) continue;
+    if (group.length !== 0) continue;
 
     const emoji: Record<ChangeStatus, string> = {
killedBy: listChangesHandler lists all changes grouped by status
statusReason: expected '## Changes (2 total)\n\n### ⛔ Blocked…' to contain 'Open'

[Killed] ArithmeticOperator
src/tools/change-request.ts:427:40
       closed: "🔒",
     };
 
-    lines.push(`### ${emoji[status]} ${status.charAt(0).toUpperCase() + status.slice(1)} (${group.length})`, ``);
+    lines.push(`### ${emoji[status]} ${status.charAt(0).toUpperCase() - status.slice(1)} (${group.length})`, ``);
     lines.push(`| ID | Title | Type | Breaking | Gates | Created |`);
     lines.push(`|---|---|---|---|---|---|`);
killedBy: listChangesHandler lists all changes grouped by status
statusReason: expected '## Changes (2 total)\n\n### 🔄 NaN (1…' to contain 'Open'

[Killed] MethodExpression
src/tools/change-request.ts:427:73
       closed: "🔒",
     };
 
-    lines.push(`### ${emoji[status]} ${status.charAt(0).toUpperCase() + status.slice(1)} (${group.length})`, ``);
+    lines.push(`### ${emoji[status]} ${status.charAt(0).toUpperCase() + status} (${group.length})`, ``);
     lines.push(`| ID | Title | Type | Breaking | Gates | Created |`);
     lines.push(`|---|---|---|---|---|---|`);
killedBy: listChangesHandler lists all changes grouped by status
statusReason: expected '## Changes (2 total)\n\n### 🔄 Iimple…' to contain 'Open'

[Killed] BlockStatement
src/tools/change-request.ts:431:28
     lines.push(`| ID | Title | Type | Breaking | Gates | Created |`);
     lines.push(`|---|---|---|---|---|---|`);
 
-    for (const c of group) {
-      const staleFlag = isStale(c, today) ? " ⚠️ stale" : "";
-      const breaking = c.breaking ? "⚠️ Yes" : "No";
-      const gates = c.required_gates.length > 0 ? c.required_gates.length.toString() : "—";
-      lines.push(`| \`${c.id}\` | ${c.title}${staleFlag} | ${c.type} | ${breaking} | ${gates} | ${c.created} |`);
-    }
+    for (const c of group) {}
     lines.push(``);
   }
killedBy: listChangesHandler shows dash in gates column for change with no required_gates
statusReason: expected '## Changes (1 total)\n\n### 📋 Open (…' to contain '—'

[Killed] EqualityOperator
src/tools/change-request.ts:434:21
     for (const c of group) {
       const staleFlag = isStale(c, today) ? " ⚠️ stale" : "";
       const breaking = c.breaking ? "⚠️ Yes" : "No";
-      const gates = c.required_gates.length > 0 ? c.required_gates.length.toString() : "—";
+      const gates = c.required_gates.length >= 0 ? c.required_gates.length.toString() : "—";
       lines.push(`| \`${c.id}\` | ${c.title}${staleFlag} | ${c.type} | ${breaking} | ${gates} | ${c.created} |`);
     }
killedBy: listChangesHandler lists all changes grouped by status
statusReason: expected '## Changes (3 total)\n\n### 🔄 Implem…' to contain '2 total'

[Killed] ConditionalExpression
src/tools/change-request.ts:434:21
     for (const c of group) {
       const staleFlag = isStale(c, today) ? " ⚠️ stale" : "";
       const breaking = c.breaking ? "⚠️ Yes" : "No";
-      const gates = c.required_gates.length > 0 ? c.required_gates.length.toString() : "—";
+      const gates = true ? c.required_gates.length.toString() : "—";
       lines.push(`| \`${c.id}\` | ${c.title}${staleFlag} | ${c.type} | ${breaking} | ${gates} | ${c.created} |`);
     }
killedBy: listChangesHandler shows dash in gates column for change with no required_gates
statusReason: expected '## Changes (1 total)\n\n### 📋 Open (…' to contain '—'

[Killed] EqualityOperator
src/tools/change-request.ts:441:7
   }
 
   const implementing = statusGroups["implementing"];
-  if (implementing.length > 0) {
+  if (implementing.length >= 0) {
     lines.push(`### ⚠️ close_cycle will be blocked until these are resolved:`, ``);
     for (const c of implementing) {
killedBy: listChangesHandler does not show close_cycle warning when no implementing changes exist
statusReason: expected '## Changes (1 total)\n\n### 📋 Open (…' not to contain 'close_cycle will be blocked'

[Killed] ConditionalExpression
src/tools/change-request.ts:441:7
   }
 
   const implementing = statusGroups["implementing"];
-  if (implementing.length > 0) {
+  if (true) {
     lines.push(`### ⚠️ close_cycle will be blocked until these are resolved:`, ``);
     for (const c of implementing) {
killedBy: listChangesHandler does not show close_cycle warning when no implementing changes exist
statusReason: expected '## Changes (1 total)\n\n### 📋 Open (…' not to contain 'close_cycle will be blocked'

[Killed] BlockStatement
src/tools/change-request.ts:443:35
   const implementing = statusGroups["implementing"];
   if (implementing.length > 0) {
     lines.push(`### ⚠️ close_cycle will be blocked until these are resolved:`, ``);
-    for (const c of implementing) {
-      lines.push(`- \`${c.id}\` — ${c.title}`);
-      if (c.required_gates.length > 0) {
-        lines.push(`  Gates: ${c.required_gates.map((g) => `\`${g}\``).join(", ")}`);
-      }
-    }
+    for (const c of implementing) {}
     lines.push(``);
   }
killedBy: listChangesHandler shows close_cycle block warning for implementing changes
statusReason: expected '## Changes (1 total)\n\n### 🔄 Implem…' to contain 'l2-coverage'

[Killed] BlockStatement
src/tools/change-request.ts:445:40
     lines.push(`### ⚠️ close_cycle will be blocked until these are resolved:`, ``);
     for (const c of implementing) {
       lines.push(`- \`${c.id}\` — ${c.title}`);
-      if (c.required_gates.length > 0) {
-        lines.push(`  Gates: ${c.required_gates.map((g) => `\`${g}\``).join(", ")}`);
-      }
+      if (c.required_gates.length > 0) {}
     }
     lines.push(``);
killedBy: listChangesHandler shows close_cycle block warning for implementing changes
statusReason: expected '## Changes (1 total)\n\n### 🔄 Implem…' to contain 'l2-coverage'

[Killed] ConditionalExpression
src/tools/change-request.ts:445:11
     lines.push(`### ⚠️ close_cycle will be blocked until these are resolved:`, ``);
     for (const c of implementing) {
       lines.push(`- \`${c.id}\` — ${c.title}`);
-      if (c.required_gates.length > 0) {
+      if (false) {
         lines.push(`  Gates: ${c.required_gates.map((g) => `\`${g}\``).join(", ")}`);
       }
killedBy: listChangesHandler shows close_cycle block warning for implementing changes
statusReason: expected '## Changes (1 total)\n\n### 🔄 Implem…' to contain 'l2-coverage'

[Killed] ArrowFunction
src/tools/change-request.ts:446:53
     for (const c of implementing) {
       lines.push(`- \`${c.id}\` — ${c.title}`);
       if (c.required_gates.length > 0) {
-        lines.push(`  Gates: ${c.required_gates.map((g) => `\`${g}\``).join(", ")}`);
+        lines.push(`  Gates: ${c.required_gates.map(() => undefined).join(", ")}`);
       }
     }
killedBy: listChangesHandler shows close_cycle block warning for implementing changes
statusReason: expected '## Changes (1 total)\n\n### 🔄 Implem…' to contain 'l2-coverage'

[Killed] BlockStatement
src/tools/change-request.ts:457:64
 
 // ── Staleness ─────────────────────────────────────────────────────────
 
-function isStale(record: ChangeRecord, today: string): boolean {
-  if (record.status === "closed" || record.status === "verified") return false;
-  try {
-    const created = new Date(record.created);
-    const now = new Date(today);
-    const days = (now.getTime() - created.getTime()) / (1000 * 60 * 60 * 24);
-    return days > 7;
-  } catch {
-    return false;
-  }
-}
+function isStale(record: ChangeRecord, today: string): boolean {}
 
killedBy: listChangesHandler marks a change created 8 days ago as stale
statusReason: expected '## Changes (3 total)\n\n### 📋 Open (…' to contain 'stale'

[Killed] BooleanLiteral
src/tools/change-request.ts:458:74
 // ── Staleness ─────────────────────────────────────────────────────────
 
 function isStale(record: ChangeRecord, today: string): boolean {
-  if (record.status === "closed" || record.status === "verified") return false;
+  if (record.status === "closed" || record.status === "verified") return true;
   try {
     const created = new Date(record.created);
killedBy: listChangesHandler never marks verified changes as stale regardless of age
statusReason: expected '## Changes (1 total)\n\n### ✅ Verifie…' not to contain 'stale'

[Killed] ConditionalExpression
src/tools/change-request.ts:458:37
 // ── Staleness ─────────────────────────────────────────────────────────
 
 function isStale(record: ChangeRecord, today: string): boolean {
-  if (record.status === "closed" || record.status === "verified") return false;
+  if (record.status === "closed" || false) return false;
   try {
     const created = new Date(record.created);
killedBy: listChangesHandler lists all changes grouped by status
statusReason: expected '## Changes (1 total)\n\n### 📋 Open (…' to contain '2 total'

[Killed] BlockStatement
src/tools/change-request.ts:459:7
 
 function isStale(record: ChangeRecord, today: string): boolean {
   if (record.status === "closed" || record.status === "verified") return false;
-  try {
-    const created = new Date(record.created);
-    const now = new Date(today);
-    const days = (now.getTime() - created.getTime()) / (1000 * 60 * 60 * 24);
-    return days > 7;
-  } catch {
+  try {} catch {
     return false;
   }
killedBy: listChangesHandler does not show close_cycle warning when no implementing changes exist
statusReason: expected '## Changes (2 total)\n\n### 🔄 Implem…' not to contain 'close_cycle will be blocked'

[Killed] ArithmeticOperator
src/tools/change-request.ts:462:57
   try {
     const created = new Date(record.created);
     const now = new Date(today);
-    const days = (now.getTime() - created.getTime()) / (1000 * 60 * 60 * 24);
+    const days = (now.getTime() - created.getTime()) / (1000 * 60 * 60 / 24);
     return days > 7;
   } catch {
killedBy: listChangesHandler does not mark a change created exactly 7 days ago as stale
statusReason: expected '## Changes (1 total)\n\n### 📋 Open (…' not to contain 'stale'

[Killed] ArithmeticOperator
src/tools/change-request.ts:462:19
   try {
     const created = new Date(record.created);
     const now = new Date(today);
-    const days = (now.getTime() - created.getTime()) / (1000 * 60 * 60 * 24);
+    const days = (now.getTime() + created.getTime()) / (1000 * 60 * 60 * 24);
     return days > 7;
   } catch {
killedBy: listChangesHandler does not mark a change created exactly 7 days ago as stale
statusReason: expected '## Changes (1 total)\n\n### 📋 Open (…' not to contain 'stale'

[Killed] EqualityOperator
src/tools/change-request.ts:463:12
     const created = new Date(record.created);
     const now = new Date(today);
     const days = (now.getTime() - created.getTime()) / (1000 * 60 * 60 * 24);
-    return days > 7;
+    return days >= 7;
   } catch {
     return false;
killedBy: listChangesHandler does not show close_cycle warning when no implementing changes exist
statusReason: expected '## Changes (2 total)\n\n### 🔄 Implem…' not to contain 'close_cycle will be blocked'

[Killed] ConditionalExpression
src/tools/change-request.ts:463:12
     const created = new Date(record.created);
     const now = new Date(today);
     const days = (now.getTime() - created.getTime()) / (1000 * 60 * 60 * 24);
-    return days > 7;
+    return true;
   } catch {
     return false;
killedBy: listChangesHandler does not mark a change created exactly 7 days ago as stale
statusReason: expected '## Changes (1 total)\n\n### 📋 Open (…' not to contain 'stale'

[NoCoverage] BlockStatement
src/tools/change-request.ts:464:11
     const now = new Date(today);
     const days = (now.getTime() - created.getTime()) / (1000 * 60 * 60 * 24);
     return days > 7;
-  } catch {
-    return false;
-  }
+  } catch {}
 }
 
