[Killed] EqualityOperator
src/tools/change-request.ts:82:84
   type: ChangeType,
 ): string[] {
   const artifacts: string[] = [];
-  const words = `${title} ${description}`.toLowerCase().split(/\s+/).filter((w) => w.length > 3);
+  const words = `${title} ${description}`.toLowerCase().split(/\s+/).filter((w) => w.length <= 3);
 
   const specFiles: Array<[string, string[]]> = [
killedBy: detectAffectedArtifacts includes use-cases.md when title contains 'workflow'
statusReason: expected [] to include 'docs/use-cases.md'

[Killed] ArrowFunction
src/tools/change-request.ts:82:77
   type: ChangeType,
 ): string[] {
   const artifacts: string[] = [];
-  const words = `${title} ${description}`.toLowerCase().split(/\s+/).filter((w) => w.length > 3);
+  const words = `${title} ${description}`.toLowerCase().split(/\s+/).filter(() => undefined);
 
   const specFiles: Array<[string, string[]]> = [
killedBy: detectAffectedArtifacts includes use-cases.md when title contains 'workflow'
statusReason: expected [] to include 'docs/use-cases.md'

[Killed] LogicalOperator
src/tools/change-request.ts:99:7
   }
 
   // Always include PRD if spec-change type
-  if (type === "spec-change" && !artifacts.includes("docs/PRD.md")) {
+  if (type === "spec-change" || !artifacts.includes("docs/PRD.md")) {
     if (existsSync(join(projectDir, "docs", "PRD.md"))) {
       artifacts.push("docs/PRD.md");
killedBy: detectAffectedArtifacts includes PRD.md for spec-change type even without keyword matches
statusReason: expected [] to include 'docs/PRD.md'

[Killed] BlockStatement
src/tools/change-request.ts:106:106
   }
 
   // ADR supersession
-  if (type === "adr-supersession" || words.some((w) => ["adr", "decision", "architecture"].includes(w))) {
-    const adrDir = join(projectDir, "docs", "adrs");
-    if (existsSync(adrDir)) {
-      artifacts.push("docs/adrs/");
-    }
-  }
+  if (type === "adr-supersession" || words.some((w) => ["adr", "decision", "architecture"].includes(w))) {}
 
   // Breaking API — flag schema and contract files
killedBy: detectAffectedArtifacts includes docs/adrs/ for adr-supersession type
statusReason: expected [] to include 'docs/adrs/'

[Killed] ConditionalExpression
src/tools/change-request.ts:193:7
   lines.push(``);
 
   lines.push(`required_gates:`);
-  if (record.required_gates.length === 0) {
+  if (true) {
     lines.push(`  []`);
   } else {
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips required_gates list
statusReason: expected [] to include 'l2-coverage'

[Killed] ConditionalExpression
src/tools/change-request.ts:220:22
     const type = (fieldRe("type") as ChangeType) || "spec-change";
     const title = fieldRe("title");
     const created = fieldRe("created");
-    const breaking = fieldRe("breaking") === "true";
+    const breaking = false;
     const breaking_details = fieldRe("breaking_details") || undefined;
     const supersedes_adr = fieldRe("supersedes_adr") || undefined;
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips a minimal record
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/tools/change-request.ts:223:28
     const breaking = fieldRe("breaking") === "true";
     const breaking_details = fieldRe("breaking_details") || undefined;
     const supersedes_adr = fieldRe("supersedes_adr") || undefined;
-    const blocked_reason = fieldRe("blocked_reason") !== "~" ? fieldRe("blocked_reason") : undefined;
+    const blocked_reason = true ? fieldRe("blocked_reason") : undefined;
     const verified_at = fieldRe("verified_at") !== "~" ? fieldRe("verified_at") : undefined;
     const closed_at = fieldRe("closed_at") !== "~" ? fieldRe("closed_at") : undefined;
killedBy: loadAllChanges handles multiple records
statusReason: expected [ { …(14) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/tools/change-request.ts:224:25
     const breaking_details = fieldRe("breaking_details") || undefined;
     const supersedes_adr = fieldRe("supersedes_adr") || undefined;
     const blocked_reason = fieldRe("blocked_reason") !== "~" ? fieldRe("blocked_reason") : undefined;
-    const verified_at = fieldRe("verified_at") !== "~" ? fieldRe("verified_at") : undefined;
+    const verified_at = false ? fieldRe("verified_at") : undefined;
     const closed_at = fieldRe("closed_at") !== "~" ? fieldRe("closed_at") : undefined;
 
killedBy: serializeChangeRecord + parseChangeRecord round-trip round-trips supersedes_adr
statusReason: ENOTEMPTY: directory not empty, rmdir 'C:\Users\JC\AppData\Local\Temp\chg-test-1776700126289\.forgecraft\changes'

[Survived] ConditionalExpression
src/tools/change-request.ts:434:21
     for (const c of group) {
       const staleFlag = isStale(c, today) ? " ⚠️ stale" : "";
       const breaking = c.breaking ? "⚠️ Yes" : "No";
-      const gates = c.required_gates.length > 0 ? c.required_gates.length.toString() : "—";
+      const gates = false ? c.required_gates.length.toString() : "—";
       lines.push(`| \`${c.id}\` | ${c.title}${staleFlag} | ${c.type} | ${breaking} | ${gates} | ${c.created} |`);
     }

[Killed] EqualityOperator
src/tools/change-request.ts:441:7
   }
 
   const implementing = statusGroups["implementing"];
-  if (implementing.length > 0) {
+  if (implementing.length <= 0) {
     lines.push(`### ⚠️ close_cycle will be blocked until these are resolved:`, ``);
     for (const c of implementing) {
killedBy: listChangesHandler shows close_cycle block warning for implementing changes
statusReason: expected '## Changes (1 total)\n\n### 🔄 Implem…' to contain 'close_cycle will be blocked'

[Killed] BlockStatement
src/tools/change-request.ts:441:32
   }
 
   const implementing = statusGroups["implementing"];
-  if (implementing.length > 0) {
-    lines.push(`### ⚠️ close_cycle will be blocked until these are resolved:`, ``);
-    for (const c of implementing) {
-      lines.push(`- \`${c.id}\` — ${c.title}`);
-      if (c.required_gates.length > 0) {
-        lines.push(`  Gates: ${c.required_gates.map((g) => `\`${g}\``).join(", ")}`);
-      }
-    }
-    lines.push(``);
-  }
+  if (implementing.length > 0) {}
 
   return { content: [{ type: "text", text: lines.join("\n") }] };
killedBy: listChangesHandler shows close_cycle block warning for implementing changes
statusReason: expected '## Changes (1 total)\n\n### 🔄 Implem…' to contain 'close_cycle will be blocked'

[Killed] EqualityOperator
src/tools/change-request.ts:458:37
 // ── Staleness ─────────────────────────────────────────────────────────
 
 function isStale(record: ChangeRecord, today: string): boolean {
-  if (record.status === "closed" || record.status === "verified") return false;
+  if (record.status === "closed" || record.status !== "verified") return false;
   try {
     const created = new Date(record.created);
killedBy: listChangesHandler marks a change created 8 days ago as stale
statusReason: expected '## Changes (1 total)\n\n### 📋 Open (…' to contain 'stale'
