[Killed] BlockStatement
src/analyzers/scorers/scorer-utils.ts:54:20
   property: GsProperty,
   score: 0 | 1 | 2,
   evidence: string[],
-): GsPropertyScore {
-  return { property, score, evidence };
-}
+): GsPropertyScore {}
 
 // ── File classification helpers ────────────────────────────────────────
killedBy: score 0 — no tests returns score 0 when no test files exist
statusReason: Cannot read properties of undefined (reading 'score')

[Killed] ObjectLiteral
src/analyzers/scorers/scorer-utils.ts:55:10
   score: 0 | 1 | 2,
   evidence: string[],
 ): GsPropertyScore {
-  return { property, score, evidence };
+  return {};
 }
 
killedBy: score 0 — no layers returns score 0 when src is empty
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/analyzers/scorers/scorer-utils.ts:61:61
 // ── File classification helpers ────────────────────────────────────────
 
 /** True for TypeScript/JavaScript/Python/Kotlin/Rust source files. */
-export function isSourceCodeFile(filePath: string): boolean {
-  return [".ts", ".tsx", ".js", ".jsx", ".py", ".kt", ".rs"].includes(extname(filePath));
-}
+export function isSourceCodeFile(filePath: string): boolean {}
 
 /** True for test or fixture files (should not require their own test). */
killedBy: score 2 — service + repository layers reports interface files in evidence when present
statusReason: expected 'No dedicated interface files (partial…' to match /Interface\/con…/contract files detected

[Killed] BlockStatement
src/analyzers/scorers/scorer-utils.ts:66:64
 }
 
 /** True for test or fixture files (should not require their own test). */
-export function isTestOrFixtureFile(filePath: string): boolean {
-  const normalized = filePath.replace(/\\/g, "/");
-  return /(\btest[_.]|\.test\.|\.spec\.|__tests__|\/tests\/|\/test\/|\/fixtures\/|\/mocks?\/|conftest|\.d\.ts)/.test(normalized);
-}
+export function isTestOrFixtureFile(filePath: string): boolean {}
 
 /** True for declaration, config, or infrastructure files. */
killedBy: score 0 — no tests returns score 2 when only test files exist (no source to miss)
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/analyzers/scorers/scorer-utils.ts:72:66
 }
 
 /** True for declaration, config, or infrastructure files. */
-export function isConfigOrDeclaration(filePath: string): boolean {
-  return /(\.d\.ts|config\.|\.config\.|migration|seed|schema\.prisma|index\.ts)/.test(filePath);
-}
+export function isConfigOrDeclaration(filePath: string): boolean {}
 
 /** True if a file path is inside a route or controller directory. */
killedBy: isConfigOrDeclaration detects .d.ts
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/analyzers/scorers/scorer-utils.ts:77:56
 }
 
 /** True if a file path is inside a route or controller directory. */
-export function isRouteFile(filePath: string): boolean {
-  const normalized = filePath.replace(/\\/g, "/");
-  return ROUTE_DIRS.some((dir) => new RegExp(`(^|/)${dir}/`, "i").test(normalized));
-}
+export function isRouteFile(filePath: string): boolean {}
 
 // ── Utility functions ──────────────────────────────────────────────────
killedBy: isRouteFile detects /routes/ directory
statusReason: expected undefined to be true // Object.is equality

[Killed] MethodExpression
src/analyzers/scorers/scorer-utils.ts:79:10
 /** True if a file path is inside a route or controller directory. */
 export function isRouteFile(filePath: string): boolean {
   const normalized = filePath.replace(/\\/g, "/");
-  return ROUTE_DIRS.some((dir) => new RegExp(`(^|/)${dir}/`, "i").test(normalized));
+  return ROUTE_DIRS.every(dir => new RegExp(`(^|/)${dir}/`, "i").test(normalized));
 }
 
killedBy: isRouteFile detects /routes/ directory
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/analyzers/scorers/scorer-utils.ts:79:26
 /** True if a file path is inside a route or controller directory. */
 export function isRouteFile(filePath: string): boolean {
   const normalized = filePath.replace(/\\/g, "/");
-  return ROUTE_DIRS.some((dir) => new RegExp(`(^|/)${dir}/`, "i").test(normalized));
+  return ROUTE_DIRS.some(() => undefined);
 }
 
killedBy: isRouteFile detects /routes/ directory
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/analyzers/scorers/scorer-utils.ts:89:9
   lines: string[],
   relPath: string,
   violations: LayerViolation[],
-): void {
-  for (let i = 0; i < lines.length; i++) {
-    const line = lines[i] as string;
-    if (COMMENT_OR_IMPORT.test(line)) continue;
-    const matchedPattern = DB_CALL_PATTERNS.find((p) => p.test(line));
-    if (matchedPattern) {
-      violations.push({ file: relPath, line: i + 1, snippet: line.slice(0, 120) });
-    }
-  }
-}
+): void {}
 
 /** Strip the file extension from a filename. */
killedBy: collectDbViolations detects prisma call
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/analyzers/scorers/scorer-utils.ts:90:42
   relPath: string,
   violations: LayerViolation[],
 ): void {
-  for (let i = 0; i < lines.length; i++) {
-    const line = lines[i] as string;
-    if (COMMENT_OR_IMPORT.test(line)) continue;
-    const matchedPattern = DB_CALL_PATTERNS.find((p) => p.test(line));
-    if (matchedPattern) {
-      violations.push({ file: relPath, line: i + 1, snippet: line.slice(0, 120) });
-    }
-  }
+  for (let i = 0; i < lines.length; i++) {}
 }
 
killedBy: collectDbViolations detects prisma call
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/analyzers/scorers/scorer-utils.ts:90:19
   relPath: string,
   violations: LayerViolation[],
 ): void {
-  for (let i = 0; i < lines.length; i++) {
+  for (let i = 0; false; i++) {
     const line = lines[i] as string;
     if (COMMENT_OR_IMPORT.test(line)) continue;
killedBy: collectDbViolations detects prisma call
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/analyzers/scorers/scorer-utils.ts:92:9
 ): void {
   for (let i = 0; i < lines.length; i++) {
     const line = lines[i] as string;
-    if (COMMENT_OR_IMPORT.test(line)) continue;
+    if (false) continue;
     const matchedPattern = DB_CALL_PATTERNS.find((p) => p.test(line));
     if (matchedPattern) {
killedBy: collectDbViolations skips comment lines
statusReason: expected [ { file: 'routes/user.ts', …(2) } ] to have a length of +0 but got 1

[Killed] ConditionalExpression
src/analyzers/scorers/scorer-utils.ts:92:9
 ): void {
   for (let i = 0; i < lines.length; i++) {
     const line = lines[i] as string;
-    if (COMMENT_OR_IMPORT.test(line)) continue;
+    if (true) continue;
     const matchedPattern = DB_CALL_PATTERNS.find((p) => p.test(line));
     if (matchedPattern) {
killedBy: collectDbViolations detects prisma call
statusReason: expected [] to have a length of 1 but got +0

[Killed] ArrowFunction
src/analyzers/scorers/scorer-utils.ts:93:50
   for (let i = 0; i < lines.length; i++) {
     const line = lines[i] as string;
     if (COMMENT_OR_IMPORT.test(line)) continue;
-    const matchedPattern = DB_CALL_PATTERNS.find((p) => p.test(line));
+    const matchedPattern = DB_CALL_PATTERNS.find(() => undefined);
     if (matchedPattern) {
       violations.push({ file: relPath, line: i + 1, snippet: line.slice(0, 120) });
killedBy: collectDbViolations detects prisma call
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/analyzers/scorers/scorer-utils.ts:94:9
     const line = lines[i] as string;
     if (COMMENT_OR_IMPORT.test(line)) continue;
     const matchedPattern = DB_CALL_PATTERNS.find((p) => p.test(line));
-    if (matchedPattern) {
+    if (false) {
       violations.push({ file: relPath, line: i + 1, snippet: line.slice(0, 120) });
     }
killedBy: collectDbViolations detects prisma call
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/analyzers/scorers/scorer-utils.ts:94:9
     const line = lines[i] as string;
     if (COMMENT_OR_IMPORT.test(line)) continue;
     const matchedPattern = DB_CALL_PATTERNS.find((p) => p.test(line));
-    if (matchedPattern) {
+    if (true) {
       violations.push({ file: relPath, line: i + 1, snippet: line.slice(0, 120) });
     }
killedBy: collectDbViolations collects multiple violations from different lines
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Killed] ArithmeticOperator
src/analyzers/scorers/scorer-utils.ts:95:46
     if (COMMENT_OR_IMPORT.test(line)) continue;
     const matchedPattern = DB_CALL_PATTERNS.find((p) => p.test(line));
     if (matchedPattern) {
-      violations.push({ file: relPath, line: i + 1, snippet: line.slice(0, 120) });
+      violations.push({ file: relPath, line: i - 1, snippet: line.slice(0, 120) });
     }
   }
killedBy: collectDbViolations detects prisma call
statusReason: expected -1 to be 1 // Object.is equality

[Killed] MethodExpression
src/analyzers/scorers/scorer-utils.ts:95:62
     if (COMMENT_OR_IMPORT.test(line)) continue;
     const matchedPattern = DB_CALL_PATTERNS.find((p) => p.test(line));
     if (matchedPattern) {
-      violations.push({ file: relPath, line: i + 1, snippet: line.slice(0, 120) });
+      violations.push({ file: relPath, line: i + 1, snippet: line });
     }
   }
killedBy: collectDbViolations truncates snippet to 120 chars
statusReason: expected 222 to be 120 // Object.is equality

[Killed] BlockStatement
src/analyzers/scorers/scorer-utils.ts:101:54
 }
 
 /** Strip the file extension from a filename. */
-export function stripExtension(name: string): string {
-  return name.replace(/\.[^.]+$/, "");
-}
+export function stripExtension(name: string): string {}
 
 /** Build the canonical expected test file path for a source file. */
killedBy: stripExtension strips .ts
statusReason: expected undefined to be 'foo' // Object.is equality

[NoCoverage] BlockStatement
src/analyzers/scorers/scorer-utils.ts:106:81
 }
 
 /** Build the canonical expected test file path for a source file. */
-export function buildExpectedTestPath(sourceFile: string, base: string): string {
-  const dir = dirname(sourceFile);
-  return `${dir}/${base}.test.ts`;
-}
+export function buildExpectedTestPath(sourceFile: string, base: string): string {}
 
 /**

[Killed] BlockStatement
src/analyzers/scorers/scorer-utils.ts:115:75
  * Check whether a test file exists for a given source base name.
  * Checks across the entire file set (co-located or in tests/ mirror).
  */
-export function testFileExists(base: string, allFiles: string[]): boolean {
-  return allFiles.some(
-    (f) =>
-      isTestOrFixtureFile(f) &&
-      stripExtension(basename(f)).replace(/\.(test|spec)$/, "") === base,
-  );
-}
+export function testFileExists(base: string, allFiles: string[]): boolean {}
 
killedBy: testFileExists finds a test file by base name
statusReason: expected undefined to be true // Object.is equality

[Killed] MethodExpression
src/analyzers/scorers/scorer-utils.ts:116:10
  * Checks across the entire file set (co-located or in tests/ mirror).
  */
 export function testFileExists(base: string, allFiles: string[]): boolean {
-  return allFiles.some(
-    (f) =>
-      isTestOrFixtureFile(f) &&
-      stripExtension(basename(f)).replace(/\.(test|spec)$/, "") === base,
-  );
+  return allFiles.every(f => isTestOrFixtureFile(f) && stripExtension(basename(f)).replace(/\.(test|spec)$/, "") === base);
 }
 
killedBy: testFileExists finds a test file by base name
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/analyzers/scorers/scorer-utils.ts:117:5
  */
 export function testFileExists(base: string, allFiles: string[]): boolean {
   return allFiles.some(
-    (f) =>
-      isTestOrFixtureFile(f) &&
-      stripExtension(basename(f)).replace(/\.(test|spec)$/, "") === base,
+    () => undefined,
   );
 }
killedBy: testFileExists finds a test file by base name
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/analyzers/scorers/scorer-utils.ts:118:7
 export function testFileExists(base: string, allFiles: string[]): boolean {
   return allFiles.some(
     (f) =>
-      isTestOrFixtureFile(f) &&
-      stripExtension(basename(f)).replace(/\.(test|spec)$/, "") === base,
+      isTestOrFixtureFile(f) || stripExtension(basename(f)).replace(/\.(test|spec)$/, "") === base,
   );
 }
killedBy: testFileExists returns false when no matching test
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/scorer-utils.ts:118:7
 export function testFileExists(base: string, allFiles: string[]): boolean {
   return allFiles.some(
     (f) =>
-      isTestOrFixtureFile(f) &&
-      stripExtension(basename(f)).replace(/\.(test|spec)$/, "") === base,
+      false,
   );
 }
killedBy: testFileExists finds a test file by base name
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/analyzers/scorers/scorer-utils.ts:119:7
   return allFiles.some(
     (f) =>
       isTestOrFixtureFile(f) &&
-      stripExtension(basename(f)).replace(/\.(test|spec)$/, "") === base,
+      stripExtension(basename(f)).replace(/\.(test|spec)$/, "") !== base,
   );
 }
killedBy: testFileExists returns false when no matching test
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/scorer-utils.ts:119:7
   return allFiles.some(
     (f) =>
       isTestOrFixtureFile(f) &&
-      stripExtension(basename(f)).replace(/\.(test|spec)$/, "") === base,
+      true,
   );
 }
killedBy: testFileExists returns false when no matching test
statusReason: expected true to be false // Object.is equality
