[Survived] EqualityOperator
src/tools/change-request.ts:99:7
   }
 
   // Always include PRD if spec-change type
-  if (type === "spec-change" && !artifacts.includes("docs/PRD.md")) {
+  if (type !== "spec-change" && !artifacts.includes("docs/PRD.md")) {
     if (existsSync(join(projectDir, "docs", "PRD.md"))) {
       artifacts.push("docs/PRD.md");

[Killed] MethodExpression
src/tools/change-request.ts:214:7
 export function parseChangeRecord(content: string, id: string): ChangeRecord | null {
   try {
     const fieldRe = (key: string) =>
-      new RegExp(`^${key}:\\s*["']?(.+?)["']?\\s*$`, "m").exec(content)?.[1]?.trim() ?? "";
+      new RegExp(`^${key}:\\s*["']?(.+?)["']?\\s*$`, "m").exec(content)?.[1] ?? "";
 
     const status = (fieldRe("status") as ChangeStatus) || "open";
killedBy: listChangesHandler shows gate names in close_cycle warning when implementing change has gates
statusReason: expected '## Changes\n\nNo change records found…' to contain 'schema-validation'
