[Killed] BlockStatement
src/analyzers/scorers/bounded-scorer.ts:12:77
  * Score the Bounded GS property.
  * 2 = zero violations, 1 = 1–2, 0 = 3+.
  */
-export function scoreBounded(violations: LayerViolation[]): GsPropertyScore {
-  const count = violations.length;
-
-  if (count === 0) {
-    return gs("bounded", 2, [
-      "No direct DB/ORM calls detected in route or controller files",
-    ]);
-  }
-
-  if (count <= 2) {
-    return gs("bounded", 1, [
-      `${count} direct DB call(s) found in route/controller files`,
-      ...violations.map((v) => `  ${v.file}:${v.line} — ${v.snippet.trim()}`),
-    ]);
-  }
-
-  return gs("bounded", 0, [
-    `${count} direct DB calls found — route layer is calling the DB directly`,
-    ...violations.slice(0, 5).map((v) => `  ${v.file}:${v.line} — ${v.snippet.trim()}`),
-    ...(count > 5 ? [`  … and ${count - 5} more`] : []),
-  ]);
-}
+export function scoreBounded(violations: LayerViolation[]): GsPropertyScore {}
 
killedBy: scoreBounded returns score 2 with no violations
statusReason: Cannot read properties of undefined (reading 'score')

[Killed] BlockStatement
src/analyzers/scorers/bounded-scorer.ts:15:20
 export function scoreBounded(violations: LayerViolation[]): GsPropertyScore {
   const count = violations.length;
 
-  if (count === 0) {
-    return gs("bounded", 2, [
-      "No direct DB/ORM calls detected in route or controller files",
-    ]);
-  }
+  if (count === 0) {}
 
   if (count <= 2) {
killedBy: scoreBounded returns score 2 with no violations
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/bounded-scorer.ts:15:7
 export function scoreBounded(violations: LayerViolation[]): GsPropertyScore {
   const count = violations.length;
 
-  if (count === 0) {
+  if (true) {
     return gs("bounded", 2, [
       "No direct DB/ORM calls detected in route or controller files",
killedBy: scoreBounded returns score 1 for 1 violation
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArrayDeclaration
src/analyzers/scorers/bounded-scorer.ts:16:29
   const count = violations.length;
 
   if (count === 0) {
-    return gs("bounded", 2, [
-      "No direct DB/ORM calls detected in route or controller files",
-    ]);
+    return gs("bounded", 2, []);
   }
 
killedBy: scoreBounded returns score 2 with no violations
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] EqualityOperator
src/analyzers/scorers/bounded-scorer.ts:21:7
     ]);
   }
 
-  if (count <= 2) {
+  if (count > 2) {
     return gs("bounded", 1, [
       `${count} direct DB call(s) found in route/controller files`,
killedBy: scoreBounded returns score 1 for 1 violation
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/bounded-scorer.ts:21:7
     ]);
   }
 
-  if (count <= 2) {
+  if (false) {
     return gs("bounded", 1, [
       `${count} direct DB call(s) found in route/controller files`,
killedBy: scoreBounded returns score 1 for 1 violation
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrayDeclaration
src/analyzers/scorers/bounded-scorer.ts:22:29
   }
 
   if (count <= 2) {
-    return gs("bounded", 1, [
-      `${count} direct DB call(s) found in route/controller files`,
-      ...violations.map((v) => `  ${v.file}:${v.line} — ${v.snippet.trim()}`),
-    ]);
+    return gs("bounded", 1, []);
   }
 
killedBy: scoreBounded returns score 1 for 1 violation
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] ArrowFunction
src/analyzers/scorers/bounded-scorer.ts:24:25
   if (count <= 2) {
     return gs("bounded", 1, [
       `${count} direct DB call(s) found in route/controller files`,
-      ...violations.map((v) => `  ${v.file}:${v.line} — ${v.snippet.trim()}`),
+      ...violations.map(() => undefined),
     ]);
   }
killedBy: scoreBounded includes violation details in score 1 evidence
statusReason: Cannot read properties of undefined (reading 'includes')

[Survived] MethodExpression
src/analyzers/scorers/bounded-scorer.ts:24:59
   if (count <= 2) {
     return gs("bounded", 1, [
       `${count} direct DB call(s) found in route/controller files`,
-      ...violations.map((v) => `  ${v.file}:${v.line} — ${v.snippet.trim()}`),
+      ...violations.map((v) => `  ${v.file}:${v.line} — ${v.snippet}`),
     ]);
   }

[Killed] ArrowFunction
src/analyzers/scorers/bounded-scorer.ts:30:35
 
   return gs("bounded", 0, [
     `${count} direct DB calls found — route layer is calling the DB directly`,
-    ...violations.slice(0, 5).map((v) => `  ${v.file}:${v.line} — ${v.snippet.trim()}`),
+    ...violations.slice(0, 5).map(() => undefined),
     ...(count > 5 ? [`  … and ${count - 5} more`] : []),
   ]);
killedBy: scoreBounded caps evidence at 5 violations for score 0, appends 'and N more'
statusReason: Cannot read properties of undefined (reading 'includes')

[Survived] MethodExpression
src/analyzers/scorers/bounded-scorer.ts:30:69
 
   return gs("bounded", 0, [
     `${count} direct DB calls found — route layer is calling the DB directly`,
-    ...violations.slice(0, 5).map((v) => `  ${v.file}:${v.line} — ${v.snippet.trim()}`),
+    ...violations.slice(0, 5).map((v) => `  ${v.file}:${v.line} — ${v.snippet}`),
     ...(count > 5 ? [`  … and ${count - 5} more`] : []),
   ]);

[Killed] ConditionalExpression
src/analyzers/scorers/bounded-scorer.ts:31:9
   return gs("bounded", 0, [
     `${count} direct DB calls found — route layer is calling the DB directly`,
     ...violations.slice(0, 5).map((v) => `  ${v.file}:${v.line} — ${v.snippet.trim()}`),
-    ...(count > 5 ? [`  … and ${count - 5} more`] : []),
+    ...(false ? [`  … and ${count - 5} more`] : []),
   ]);
 }
killedBy: scoreBounded caps evidence at 5 violations for score 0, appends 'and N more'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/bounded-scorer.ts:31:9
   return gs("bounded", 0, [
     `${count} direct DB calls found — route layer is calling the DB directly`,
     ...violations.slice(0, 5).map((v) => `  ${v.file}:${v.line} — ${v.snippet.trim()}`),
-    ...(count > 5 ? [`  … and ${count - 5} more`] : []),
+    ...(true ? [`  … and ${count - 5} more`] : []),
   ]);
 }
killedBy: scoreBounded does not append 'more' when exactly 5 violations
statusReason: expected true to be false // Object.is equality
