[Killed] ArrowFunction
src/analyzers/scorers/composable-scorer.ts:26:10
     join(root, "tools"), join(root, "handlers"),
     join(root, "use-cases"), join(root, "usecases"),
     "services", "service",
-  ].find((d) => existsSync(join(projectDir, d)));
+  ].find(() => undefined);
 
   const repositoryDir = [
killedBy: score 1 — service layer only returns score 1 with src/services/
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrowFunction
src/analyzers/scorers/composable-scorer.ts:33:10
     join(root, "registry"), join(root, "adapters"),
     join(root, "providers"), join(root, "loaders"),
     "repositories", "repository",
-  ].find((d) => existsSync(join(projectDir, d)));
+  ].find(() => undefined);
 
   const hasInterfaces = allFiles.some(
killedBy: score 2 — service + repository layers returns score 2 with src/services/ + src/repositories/
statusReason: expected 1 to be 2 // Object.is equality

[Killed] MethodExpression
src/analyzers/scorers/composable-scorer.ts:35:25
     "repositories", "repository",
   ].find((d) => existsSync(join(projectDir, d)));
 
-  const hasInterfaces = allFiles.some(
-    (f) =>
-      /\/(interfaces?|contracts?|ports?|types?|core)\//i.test(f.replace(/\\/g, "/")) &&
-      isSourceCodeFile(f),
-  );
+  const hasInterfaces = allFiles.every(f => /\/(interfaces?|contracts?|ports?|types?|core)\//i.test(f.replace(/\\/g, "/")) && isSourceCodeFile(f));
 
   if (serviceDir && repositoryDir) {
killedBy: score 2 — service + repository layers notes partial credit when no interface files
statusReason: expected 'Interface/contract files detected' to match /partial credit/

[Killed] ArrowFunction
src/analyzers/scorers/composable-scorer.ts:36:5
   ].find((d) => existsSync(join(projectDir, d)));
 
   const hasInterfaces = allFiles.some(
-    (f) =>
-      /\/(interfaces?|contracts?|ports?|types?|core)\//i.test(f.replace(/\\/g, "/")) &&
-      isSourceCodeFile(f),
+    () => undefined,
   );
 
killedBy: score 2 — service + repository layers reports interface files in evidence when present
statusReason: expected 'No dedicated interface files (partial…' to match /Interface\/con…/contract files detected

[Killed] ConditionalExpression
src/analyzers/scorers/composable-scorer.ts:37:7
 
   const hasInterfaces = allFiles.some(
     (f) =>
-      /\/(interfaces?|contracts?|ports?|types?|core)\//i.test(f.replace(/\\/g, "/")) &&
-      isSourceCodeFile(f),
+      false,
   );
 
killedBy: score 2 — service + repository layers reports interface files in evidence when present
statusReason: expected 'No dedicated interface files (partial…' to match /Interface\/con…/contract files detected

[Killed] ConditionalExpression
src/analyzers/scorers/composable-scorer.ts:37:7
 
   const hasInterfaces = allFiles.some(
     (f) =>
-      /\/(interfaces?|contracts?|ports?|types?|core)\//i.test(f.replace(/\\/g, "/")) &&
-      isSourceCodeFile(f),
+      true,
   );
 
killedBy: interface detection — singular directory names non-source file matching interface dir does not count
statusReason: expected 'Interface/contract files detected' to match /partial credit/

[Killed] ConditionalExpression
src/analyzers/scorers/composable-scorer.ts:41:7
       isSourceCodeFile(f),
   );
 
-  if (serviceDir && repositoryDir) {
+  if (true) {
     return gs("composable", 2, [
       `Service layer found: ${serviceDir}/`,
killedBy: score 0 — no layers returns score 0 when src is empty
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/analyzers/scorers/composable-scorer.ts:41:36
       isSourceCodeFile(f),
   );
 
-  if (serviceDir && repositoryDir) {
-    return gs("composable", 2, [
-      `Service layer found: ${serviceDir}/`,
-      `Repository layer found: ${repositoryDir}/`,
-      hasInterfaces
-        ? "Interface/contract files detected"
-        : "No dedicated interface files (partial credit)",
-    ]);
-  }
+  if (serviceDir && repositoryDir) {}
 
   if (serviceDir) {
killedBy: score 2 — service + repository layers returns score 2 with src/services/ + src/repositories/
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArrayDeclaration
src/analyzers/scorers/composable-scorer.ts:42:32
   );
 
   if (serviceDir && repositoryDir) {
-    return gs("composable", 2, [
-      `Service layer found: ${serviceDir}/`,
-      `Repository layer found: ${repositoryDir}/`,
-      hasInterfaces
-        ? "Interface/contract files detected"
-        : "No dedicated interface files (partial credit)",
-    ]);
+    return gs("composable", 2, []);
   }
 
killedBy: score 2 — service + repository layers returns score 2 with src/services/ + src/repositories/
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] ConditionalExpression
src/analyzers/scorers/composable-scorer.ts:51:7
     ]);
   }
 
-  if (serviceDir) {
+  if (false) {
     return gs("composable", 1, [
       `Service layer found: ${serviceDir}/`,
killedBy: score 1 — service layer only returns score 1 with src/services/
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/composable-scorer.ts:51:7
     ]);
   }
 
-  if (serviceDir) {
+  if (true) {
     return gs("composable", 1, [
       `Service layer found: ${serviceDir}/`,
killedBy: score 0 — no layers returns score 0 when src is empty
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrayDeclaration
src/analyzers/scorers/composable-scorer.ts:52:32
   }
 
   if (serviceDir) {
-    return gs("composable", 1, [
-      `Service layer found: ${serviceDir}/`,
-      "No repository layer found — consider extracting DB access to repositories/",
-    ]);
+    return gs("composable", 1, []);
   }
 
killedBy: score 1 — service layer only returns score 1 with src/services/
statusReason: .toMatch() expects to receive a string, but got undefined
