[Killed] ConditionalExpression
src/analyzers/scorers/defended-scorer.ts:17:28
 export function scoreDefended(projectDir: string): GsPropertyScore {
   const huskyHook = join(projectDir, ".husky", "pre-commit");
   const gitHook = join(projectDir, ".git", "hooks", "pre-commit");
-  const hasPreCommitHook = existsSync(huskyHook) || existsSync(gitHook);
+  const hasPreCommitHook = true;
 
   const lintConfigs = [
killedBy: score 0 — no hooks, no lint returns score 0 when directory is empty
statusReason: expected 2 to be +0 // Object.is equality

[Killed] LogicalOperator
src/analyzers/scorers/defended-scorer.ts:17:28
 export function scoreDefended(projectDir: string): GsPropertyScore {
   const huskyHook = join(projectDir, ".husky", "pre-commit");
   const gitHook = join(projectDir, ".git", "hooks", "pre-commit");
-  const hasPreCommitHook = existsSync(huskyHook) || existsSync(gitHook);
+  const hasPreCommitHook = existsSync(huskyHook) && existsSync(gitHook);
 
   const lintConfigs = [
killedBy: score 2 — pre-commit hook present returns score 2 with .git/hooks/pre-commit
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrowFunction
src/analyzers/scorers/defended-scorer.ts:25:36
     "eslint.config.js", "eslint.config.mjs",
     ".pylintrc", "pyproject.toml", "biome.json", ".oxlintrc.json",
   ];
-  const hasLint = lintConfigs.some((c) => existsSync(join(projectDir, c)));
+  const hasLint = lintConfigs.some(() => undefined);
 
   if (hasPreCommitHook) {
killedBy: score 1 — lint only returns score 1 with eslint.config.js
statusReason: expected +0 to be 1 // Object.is equality

[Killed] MethodExpression
src/analyzers/scorers/defended-scorer.ts:25:19
     "eslint.config.js", "eslint.config.mjs",
     ".pylintrc", "pyproject.toml", "biome.json", ".oxlintrc.json",
   ];
-  const hasLint = lintConfigs.some((c) => existsSync(join(projectDir, c)));
+  const hasLint = lintConfigs.every(c => existsSync(join(projectDir, c)));
 
   if (hasPreCommitHook) {
killedBy: score 1 — lint only returns score 1 with eslint.config.js
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/defended-scorer.ts:27:7
   ];
   const hasLint = lintConfigs.some((c) => existsSync(join(projectDir, c)));
 
-  if (hasPreCommitHook) {
+  if (true) {
     return gs("defended", 2, [
       `Pre-commit hook found: ${existsSync(huskyHook) ? ".husky/pre-commit" : ".git/hooks/pre-commit"}`,
killedBy: score 0 — no hooks, no lint returns score 0 when directory is empty
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/defended-scorer.ts:27:7
   ];
   const hasLint = lintConfigs.some((c) => existsSync(join(projectDir, c)));
 
-  if (hasPreCommitHook) {
+  if (false) {
     return gs("defended", 2, [
       `Pre-commit hook found: ${existsSync(huskyHook) ? ".husky/pre-commit" : ".git/hooks/pre-commit"}`,
killedBy: score 2 — pre-commit hook present returns score 2 with .git/hooks/pre-commit
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArrayDeclaration
src/analyzers/scorers/defended-scorer.ts:28:30
   const hasLint = lintConfigs.some((c) => existsSync(join(projectDir, c)));
 
   if (hasPreCommitHook) {
-    return gs("defended", 2, [
-      `Pre-commit hook found: ${existsSync(huskyHook) ? ".husky/pre-commit" : ".git/hooks/pre-commit"}`,
-      hasLint ? "Lint configuration present" : "No lint config detected",
-    ]);
+    return gs("defended", 2, []);
   }
 
killedBy: score 2 — pre-commit hook present returns score 2 with .git/hooks/pre-commit
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] BlockStatement
src/analyzers/scorers/defended-scorer.ts:34:16
     ]);
   }
 
-  if (hasLint) {
-    return gs("defended", 1, [
-      "Lint configuration present but no pre-commit hook found",
-      "Add a pre-commit hook (e.g. husky) to block non-conforming commits",
-    ]);
-  }
+  if (hasLint) {}
 
   return gs("defended", 0, [
killedBy: score 1 — lint only returns score 1 with eslint.config.js
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/defended-scorer.ts:34:7
     ]);
   }
 
-  if (hasLint) {
+  if (true) {
     return gs("defended", 1, [
       "Lint configuration present but no pre-commit hook found",
killedBy: score 0 — no hooks, no lint returns score 0 when directory is empty
statusReason: expected 1 to be +0 // Object.is equality
