[Killed] ArrowFunction
src/analyzers/scorers/self-describing-scorer.ts:27:39
     "CONVENTIONS.md",
   ];
 
-  const found = instructionPaths.find((p) => existsSync(join(projectDir, p)));
+  const found = instructionPaths.find(() => undefined);
 
   if (!found) {
killedBy: score 1 — file found but stub returns score 1 for CLAUDE.md with fewer than MIN lines
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/analyzers/scorers/self-describing-scorer.ts:29:7
 
   const found = instructionPaths.find((p) => existsSync(join(projectDir, p)));
 
-  if (!found) {
+  if (found) {
     return gs("self-describing", 0, ["No AI assistant instruction file found"]);
   }
killedBy: score 0 — no instruction file returns score 0 when directory is empty
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/self-describing-scorer.ts:29:7
 
   const found = instructionPaths.find((p) => existsSync(join(projectDir, p)));
 
-  if (!found) {
+  if (false) {
     return gs("self-describing", 0, ["No AI assistant instruction file found"]);
   }
killedBy: score 0 — no instruction file returns score 0 when directory is empty
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/analyzers/scorers/self-describing-scorer.ts:34:7
   }
 
   let content = "";
-  try { content = readFileSync(join(projectDir, found), "utf-8"); } catch { /* empty */ }
+  try {} catch { /* empty */ }
   const lines = content.split("\n").filter((l) => l.trim().length > 0);
 
killedBy: score 1 — file found but stub returns score 1 for CLAUDE.md with enough lines but too few keywords
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/self-describing-scorer.ts:35:51
 
   let content = "";
   try { content = readFileSync(join(projectDir, found), "utf-8"); } catch { /* empty */ }
-  const lines = content.split("\n").filter((l) => l.trim().length > 0);
+  const lines = content.split("\n").filter((l) => true);
 
   if (lines.length < MIN_INSTRUCTION_FILE_LINES) {
killedBy: score 2 — substantive instruction file blank lines are excluded from non-empty line count
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/self-describing-scorer.ts:35:51
 
   let content = "";
   try { content = readFileSync(join(projectDir, found), "utf-8"); } catch { /* empty */ }
-  const lines = content.split("\n").filter((l) => l.trim().length > 0);
+  const lines = content.split("\n").filter((l) => false);
 
   if (lines.length < MIN_INSTRUCTION_FILE_LINES) {
killedBy: score 1 — file found but stub returns score 1 for CLAUDE.md with enough lines but too few keywords
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/analyzers/scorers/self-describing-scorer.ts:37:7
   try { content = readFileSync(join(projectDir, found), "utf-8"); } catch { /* empty */ }
   const lines = content.split("\n").filter((l) => l.trim().length > 0);
 
-  if (lines.length < MIN_INSTRUCTION_FILE_LINES) {
+  if (lines.length >= MIN_INSTRUCTION_FILE_LINES) {
     return gs("self-describing", 1, [
       `${found} found but only ${lines.length} non-empty lines (< ${MIN_INSTRUCTION_FILE_LINES} — treat as stub)`,
killedBy: score 1 — file found but stub returns score 1 for CLAUDE.md with fewer than MIN lines
statusReason: expected 'CLAUDE.md found (2 lines) but covers …' to match /non-empty lines/

[Killed] ConditionalExpression
src/analyzers/scorers/self-describing-scorer.ts:37:7
   try { content = readFileSync(join(projectDir, found), "utf-8"); } catch { /* empty */ }
   const lines = content.split("\n").filter((l) => l.trim().length > 0);
 
-  if (lines.length < MIN_INSTRUCTION_FILE_LINES) {
+  if (true) {
     return gs("self-describing", 1, [
       `${found} found but only ${lines.length} non-empty lines (< ${MIN_INSTRUCTION_FILE_LINES} — treat as stub)`,
killedBy: score 1 — file found but stub returns score 1 for CLAUDE.md with enough lines but too few keywords
statusReason: expected false to be true // Object.is equality

[Killed] ArrayDeclaration
src/analyzers/scorers/self-describing-scorer.ts:38:37
   const lines = content.split("\n").filter((l) => l.trim().length > 0);
 
   if (lines.length < MIN_INSTRUCTION_FILE_LINES) {
-    return gs("self-describing", 1, [
-      `${found} found but only ${lines.length} non-empty lines (< ${MIN_INSTRUCTION_FILE_LINES} — treat as stub)`,
-    ]);
+    return gs("self-describing", 1, []);
   }
 
killedBy: score 1 — file found but stub returns score 1 for CLAUDE.md with fewer than MIN lines
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] MethodExpression
src/analyzers/scorers/self-describing-scorer.ts:43:17
     ]);
   }
 
-  const lower = content.toLowerCase();
+  const lower = content.toUpperCase();
   const hits = INSTRUCTION_COVERAGE_KEYWORDS.filter((kw) => lower.includes(kw));
 
killedBy: score 2 — substantive instruction file returns score 2 for CLAUDE.md with enough lines and keywords
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArrowFunction
src/analyzers/scorers/self-describing-scorer.ts:44:53
   }
 
   const lower = content.toLowerCase();
-  const hits = INSTRUCTION_COVERAGE_KEYWORDS.filter((kw) => lower.includes(kw));
+  const hits = INSTRUCTION_COVERAGE_KEYWORDS.filter(() => undefined);
 
   if (hits.length < MIN_KEYWORD_HITS) {
killedBy: score 2 — substantive instruction file returns score 2 for CLAUDE.md with enough lines and keywords
statusReason: expected 1 to be 2 // Object.is equality

[Killed] MethodExpression
src/analyzers/scorers/self-describing-scorer.ts:44:16
   }
 
   const lower = content.toLowerCase();
-  const hits = INSTRUCTION_COVERAGE_KEYWORDS.filter((kw) => lower.includes(kw));
+  const hits = INSTRUCTION_COVERAGE_KEYWORDS;
 
   if (hits.length < MIN_KEYWORD_HITS) {
killedBy: score 1 — file found but stub returns score 1 for CLAUDE.md with enough lines but too few keywords
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/self-describing-scorer.ts:46:7
   const lower = content.toLowerCase();
   const hits = INSTRUCTION_COVERAGE_KEYWORDS.filter((kw) => lower.includes(kw));
 
-  if (hits.length < MIN_KEYWORD_HITS) {
+  if (true) {
     return gs("self-describing", 1, [
       `${found} found (${lines.length} lines) but covers fewer than ${MIN_KEYWORD_HITS} architecture/convention keywords`,
killedBy: score 2 — substantive instruction file returns score 2 for CLAUDE.md with enough lines and keywords
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
src/analyzers/scorers/self-describing-scorer.ts:46:7
   const lower = content.toLowerCase();
   const hits = INSTRUCTION_COVERAGE_KEYWORDS.filter((kw) => lower.includes(kw));
 
-  if (hits.length < MIN_KEYWORD_HITS) {
+  if (hits.length <= MIN_KEYWORD_HITS) {
     return gs("self-describing", 1, [
       `${found} found (${lines.length} lines) but covers fewer than ${MIN_KEYWORD_HITS} architecture/convention keywords`,
killedBy: score 2 — substantive instruction file returns score 2 for CLAUDE.md with enough lines and keywords
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArrowFunction
src/analyzers/scorers/self-describing-scorer.ts:49:65
   if (hits.length < MIN_KEYWORD_HITS) {
     return gs("self-describing", 1, [
       `${found} found (${lines.length} lines) but covers fewer than ${MIN_KEYWORD_HITS} architecture/convention keywords`,
-      `Missing keywords: ${INSTRUCTION_COVERAGE_KEYWORDS.filter((kw) => !lower.includes(kw)).slice(0, 5).join(", ")}`,
+      `Missing keywords: ${INSTRUCTION_COVERAGE_KEYWORDS.filter(() => undefined).slice(0, 5).join(", ")}`,
     ]);
   }
killedBy: score 1 — missing keywords evidence lists specific missing keywords in evidence
statusReason: expected 18 to be greater than 18

[Survived] BooleanLiteral
src/analyzers/scorers/self-describing-scorer.ts:49:73
   if (hits.length < MIN_KEYWORD_HITS) {
     return gs("self-describing", 1, [
       `${found} found (${lines.length} lines) but covers fewer than ${MIN_KEYWORD_HITS} architecture/convention keywords`,
-      `Missing keywords: ${INSTRUCTION_COVERAGE_KEYWORDS.filter((kw) => !lower.includes(kw)).slice(0, 5).join(", ")}`,
+      `Missing keywords: ${INSTRUCTION_COVERAGE_KEYWORDS.filter((kw) => lower.includes(kw)).slice(0, 5).join(", ")}`,
     ]);
   }

[Killed] ArrayDeclaration
src/analyzers/scorers/self-describing-scorer.ts:53:35
     ]);
   }
 
-  return gs("self-describing", 2, [
-    `${found} found — ${lines.length} non-empty lines`,
-    `Covers: ${hits.join(", ")}`,
-  ]);
+  return gs("self-describing", 2, []);
 }
 
killedBy: score 2 — substantive instruction file returns score 2 for CLAUDE.md with enough lines and keywords
statusReason: .toMatch() expects to receive a string, but got undefined
