[Killed] MethodExpression
src/analyzers/scorers/verifiable-scorer.ts:17:21
   missingTestFiles: MissingTestFile[],
   allFiles: string[],
 ): GsPropertyScore {
-  const testFiles = allFiles.filter(isTestOrFixtureFile);
+  const testFiles = allFiles;
 
   if (testFiles.length === 0) {
killedBy: score 0 — no tests returns score 0 when no test files exist
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/verifiable-scorer.ts:19:7
 ): GsPropertyScore {
   const testFiles = allFiles.filter(isTestOrFixtureFile);
 
-  if (testFiles.length === 0) {
+  if (true) {
     return gs("verifiable", 0, ["No test files found in project"]);
   }
killedBy: score 0 — no tests returns score 2 when only test files exist (no source to miss)
statusReason: expected +0 to be 2 // Object.is equality

[Killed] EqualityOperator
src/analyzers/scorers/verifiable-scorer.ts:19:7
 ): GsPropertyScore {
   const testFiles = allFiles.filter(isTestOrFixtureFile);
 
-  if (testFiles.length === 0) {
+  if (testFiles.length !== 0) {
     return gs("verifiable", 0, ["No test files found in project"]);
   }
killedBy: score 0 — no tests returns score 0 when no test files exist
statusReason: expected 2 to be +0 // Object.is equality

[Killed] ArrayDeclaration
src/analyzers/scorers/verifiable-scorer.ts:20:32
   const testFiles = allFiles.filter(isTestOrFixtureFile);
 
   if (testFiles.length === 0) {
-    return gs("verifiable", 0, ["No test files found in project"]);
+    return gs("verifiable", 0, []);
   }
 
killedBy: score 0 — no tests returns score 0 when no test files exist
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] MethodExpression
src/analyzers/scorers/verifiable-scorer.ts:23:23
     return gs("verifiable", 0, ["No test files found in project"]);
   }
 
-  const sourceCount = allFiles.filter(
-    (f) => isSourceCodeFile(f) && !isTestOrFixtureFile(f) && !isConfigOrDeclaration(f),
-  ).length;
+  const sourceCount = allFiles.length;
 
   const missingCount = missingTestFiles.length;
killedBy: score 2 — tests pass and coverage ≥ 80% returns score 1 when exactly 21% missing
statusReason: expected 2 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/analyzers/scorers/verifiable-scorer.ts:24:35
   }
 
   const sourceCount = allFiles.filter(
-    (f) => isSourceCodeFile(f) && !isTestOrFixtureFile(f) && !isConfigOrDeclaration(f),
+    (f) => isSourceCodeFile(f) && isTestOrFixtureFile(f) && !isConfigOrDeclaration(f),
   ).length;
 
killedBy: score 2 — tests pass and coverage ≥ 80% returns score 2 when exactly 20% missing (boundary — ≤ not <)
statusReason: expected 1 to be 2 // Object.is equality

[Killed] LogicalOperator
src/analyzers/scorers/verifiable-scorer.ts:24:12
   }
 
   const sourceCount = allFiles.filter(
-    (f) => isSourceCodeFile(f) && !isTestOrFixtureFile(f) && !isConfigOrDeclaration(f),
+    (f) => isSourceCodeFile(f) && !isTestOrFixtureFile(f) || !isConfigOrDeclaration(f),
   ).length;
 
killedBy: score 2 — tests pass and coverage ≥ 80% returns score 1 when exactly 21% missing
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/analyzers/scorers/verifiable-scorer.ts:28:40
   ).length;
 
   const missingCount = missingTestFiles.length;
-  const missingPct = sourceCount > 0 ? missingCount / sourceCount : 0;
+  const missingPct = sourceCount > 0 ? missingCount * sourceCount : 0;
   const coveredPct = Math.round((1 - missingPct) * 100);
 
killedBy: score 2 — tests pass and coverage ≥ 80% returns score 2 when missing ≤ 20% of source modules
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/verifiable-scorer.ts:28:22
   ).length;
 
   const missingCount = missingTestFiles.length;
-  const missingPct = sourceCount > 0 ? missingCount / sourceCount : 0;
+  const missingPct = false ? missingCount / sourceCount : 0;
   const coveredPct = Math.round((1 - missingPct) * 100);
 
killedBy: score 1 — tests exist but coverage or pass is insufficient returns score 1 when coverage is below 80%
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/analyzers/scorers/verifiable-scorer.ts:29:33
 
   const missingCount = missingTestFiles.length;
   const missingPct = sourceCount > 0 ? missingCount / sourceCount : 0;
-  const coveredPct = Math.round((1 - missingPct) * 100);
+  const coveredPct = Math.round((1 - missingPct) / 100);
 
   if (testsPassed && missingPct <= 0.2) {
killedBy: score 2 — tests pass and coverage ≥ 80% returns score 2 when all tests pass and no missing files
statusReason: expected '0% of source modules have test counte…' to match /100%/

[Killed] ArithmeticOperator
src/analyzers/scorers/verifiable-scorer.ts:29:34
 
   const missingCount = missingTestFiles.length;
   const missingPct = sourceCount > 0 ? missingCount / sourceCount : 0;
-  const coveredPct = Math.round((1 - missingPct) * 100);
+  const coveredPct = Math.round((1 + missingPct) * 100);
 
   if (testsPassed && missingPct <= 0.2) {
killedBy: evidence content coveredPct uses (1 - missingPct), not (1 + missingPct)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/analyzers/scorers/verifiable-scorer.ts:31:22
   const missingPct = sourceCount > 0 ? missingCount / sourceCount : 0;
   const coveredPct = Math.round((1 - missingPct) * 100);
 
-  if (testsPassed && missingPct <= 0.2) {
+  if (testsPassed && missingPct > 0.2) {
     return gs("verifiable", 2, [
       `Tests passed — ${testFiles.length} test file(s) found`,
killedBy: score 0 — no tests returns score 2 when only test files exist (no source to miss)
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/verifiable-scorer.ts:31:7
   const missingPct = sourceCount > 0 ? missingCount / sourceCount : 0;
   const coveredPct = Math.round((1 - missingPct) * 100);
 
-  if (testsPassed && missingPct <= 0.2) {
+  if (false) {
     return gs("verifiable", 2, [
       `Tests passed — ${testFiles.length} test file(s) found`,
killedBy: score 0 — no tests returns score 2 when only test files exist (no source to miss)
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArrayDeclaration
src/analyzers/scorers/verifiable-scorer.ts:32:32
   const coveredPct = Math.round((1 - missingPct) * 100);
 
   if (testsPassed && missingPct <= 0.2) {
-    return gs("verifiable", 2, [
-      `Tests passed — ${testFiles.length} test file(s) found`,
-      `${coveredPct}% of source modules have test counterparts`,
-    ]);
+    return gs("verifiable", 2, []);
   }
 
killedBy: score 2 — tests pass and coverage ≥ 80% returns score 2 when all tests pass and no missing files
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] BooleanLiteral
src/analyzers/scorers/verifiable-scorer.ts:39:7
   }
 
   const evidence: string[] = [`${testFiles.length} test file(s) found`];
-  if (!testsPassed) evidence.push("Test suite did not pass");
+  if (testsPassed) evidence.push("Test suite did not pass");
   if (missingPct > 0.2) {
     evidence.push(`${coveredPct}% of source modules have tests (target ≥ 80%)`);
killedBy: score 1 — tests exist but coverage or pass is insufficient returns score 1 when tests fail even with good coverage
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/analyzers/scorers/verifiable-scorer.ts:39:7
   }
 
   const evidence: string[] = [`${testFiles.length} test file(s) found`];
-  if (!testsPassed) evidence.push("Test suite did not pass");
+  if (false) evidence.push("Test suite did not pass");
   if (missingPct > 0.2) {
     evidence.push(`${coveredPct}% of source modules have tests (target ≥ 80%)`);
killedBy: score 1 — tests exist but coverage or pass is insufficient returns score 1 when tests fail even with good coverage
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/analyzers/scorers/verifiable-scorer.ts:40:25
 
   const evidence: string[] = [`${testFiles.length} test file(s) found`];
   if (!testsPassed) evidence.push("Test suite did not pass");
-  if (missingPct > 0.2) {
-    evidence.push(`${coveredPct}% of source modules have tests (target ≥ 80%)`);
-    evidence.push(`${missingCount} module(s) without tests`);
-  }
+  if (missingPct > 0.2) {}
 
   return gs("verifiable", 1, evidence);
killedBy: score 1 — tests exist but coverage or pass is insufficient returns score 1 when coverage is below 80%
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/analyzers/scorers/verifiable-scorer.ts:40:7
 
   const evidence: string[] = [`${testFiles.length} test file(s) found`];
   if (!testsPassed) evidence.push("Test suite did not pass");
-  if (missingPct > 0.2) {
+  if (missingPct <= 0.2) {
     evidence.push(`${coveredPct}% of source modules have tests (target ≥ 80%)`);
     evidence.push(`${missingCount} module(s) without tests`);
killedBy: score 1 — tests exist but coverage or pass is insufficient returns score 1 when coverage is below 80%
statusReason: expected false to be true // Object.is equality
