[Killed] ConditionalExpression
src/cli/args.ts:33:10
   const flags: Flags = {};
   let i = 0;
 
-  while (i < rest.length) {
+  while (false) {
     const arg = rest[i]!;
     if (arg.startsWith("--no-")) {
killedBy: parseCliArgs positional arguments collects positional args before flags
statusReason: expected [] to deeply equal [ '/tmp/project' ]

[Killed] EqualityOperator
src/cli/args.ts:33:10
   const flags: Flags = {};
   let i = 0;
 
-  while (i < rest.length) {
+  while (i >= rest.length) {
     const arg = rest[i]!;
     if (arg.startsWith("--no-")) {
killedBy: parseCliArgs command extraction defaults to 'serve' when no arguments given
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ConditionalExpression
src/cli/args.ts:35:9
 
   while (i < rest.length) {
     const arg = rest[i]!;
-    if (arg.startsWith("--no-")) {
+    if (false) {
       flags[arg.slice(5)] = false;
       i++;
killedBy: parseCliArgs boolean flags parses --no-flag as false
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/cli/args.ts:35:9
 
   while (i < rest.length) {
     const arg = rest[i]!;
-    if (arg.startsWith("--no-")) {
+    if (true) {
       flags[arg.slice(5)] = false;
       i++;
killedBy: parseCliArgs positional arguments collects positional args before flags
statusReason: expected [] to deeply equal [ '/tmp/project' ]

[Killed] BooleanLiteral
src/cli/args.ts:36:29
   while (i < rest.length) {
     const arg = rest[i]!;
     if (arg.startsWith("--no-")) {
-      flags[arg.slice(5)] = false;
+      flags[arg.slice(5)] = true;
       i++;
     } else if (arg.startsWith("--")) {
killedBy: parseCliArgs boolean flags parses --no-flag as false
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/cli/args.ts:36:13
   while (i < rest.length) {
     const arg = rest[i]!;
     if (arg.startsWith("--no-")) {
-      flags[arg.slice(5)] = false;
+      flags[arg] = false;
       i++;
     } else if (arg.startsWith("--")) {
killedBy: parseCliArgs boolean flags parses --no-flag as false
statusReason: expected undefined to be false // Object.is equality

[Killed] UpdateOperator
src/cli/args.ts:37:7
     const arg = rest[i]!;
     if (arg.startsWith("--no-")) {
       flags[arg.slice(5)] = false;
-      i++;
+      i--;
     } else if (arg.startsWith("--")) {
       const key = arg.slice(2);
killedBy: parseCliArgs boolean flags parses --no-flag as false
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ConditionalExpression
src/cli/args.ts:38:16
     if (arg.startsWith("--no-")) {
       flags[arg.slice(5)] = false;
       i++;
-    } else if (arg.startsWith("--")) {
+    } else if (true) {
       const key = arg.slice(2);
       const values: string[] = [];
killedBy: parseCliArgs positional arguments collects positional args before flags
statusReason: expected [] to deeply equal [ '/tmp/project' ]

[Killed] MethodExpression
src/cli/args.ts:38:16
     if (arg.startsWith("--no-")) {
       flags[arg.slice(5)] = false;
       i++;
-    } else if (arg.startsWith("--")) {
+    } else if (arg.endsWith("--")) {
       const key = arg.slice(2);
       const values: string[] = [];
killedBy: parseCliArgs positional arguments non-flag arg after a value-flag is consumed as the flag's value, not positional
statusReason: expected undefined to deeply equal [ '/tmp/project' ]

[Killed] MethodExpression
src/cli/args.ts:39:19
       flags[arg.slice(5)] = false;
       i++;
     } else if (arg.startsWith("--")) {
-      const key = arg.slice(2);
+      const key = arg;
       const values: string[] = [];
       i++;
killedBy: parseCliArgs positional arguments non-flag arg after a value-flag is consumed as the flag's value, not positional
statusReason: expected undefined to deeply equal [ '/tmp/project' ]

[Killed] UpdateOperator
src/cli/args.ts:41:7
     } else if (arg.startsWith("--")) {
       const key = arg.slice(2);
       const values: string[] = [];
-      i++;
+      i--;
       while (i < rest.length && !rest[i]!.startsWith("--")) {
         values.push(rest[i]!);
killedBy: parseCliArgs positional arguments non-flag arg after a value-flag is consumed as the flag's value, not positional
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ConditionalExpression
src/cli/args.ts:42:14
       const key = arg.slice(2);
       const values: string[] = [];
       i++;
-      while (i < rest.length && !rest[i]!.startsWith("--")) {
+      while (false) {
         values.push(rest[i]!);
         i++;
killedBy: parseCliArgs positional arguments non-flag arg after a value-flag is consumed as the flag's value, not positional
statusReason: expected true to deeply equal [ '/tmp/project' ]

[Killed] EqualityOperator
src/cli/args.ts:42:14
       const key = arg.slice(2);
       const values: string[] = [];
       i++;
-      while (i < rest.length && !rest[i]!.startsWith("--")) {
+      while (i <= rest.length && !rest[i]!.startsWith("--")) {
         values.push(rest[i]!);
         i++;
killedBy: parseCliArgs positional arguments non-flag arg after a value-flag is consumed as the flag's value, not positional
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Timeout] UpdateOperator
src/cli/args.ts:44:9
       i++;
       while (i < rest.length && !rest[i]!.startsWith("--")) {
         values.push(rest[i]!);
-        i++;
+        i--;
       }
       flags[key] = values.length === 0 ? true : values;

[Killed] BooleanLiteral
src/cli/args.ts:46:42
         values.push(rest[i]!);
         i++;
       }
-      flags[key] = values.length === 0 ? true : values;
+      flags[key] = values.length === 0 ? false : values;
     } else {
       positional.push(arg);
killedBy: parseCliArgs boolean flags parses --flag alone as true
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/cli/args.ts:46:20
         values.push(rest[i]!);
         i++;
       }
-      flags[key] = values.length === 0 ? true : values;
+      flags[key] = values.length !== 0 ? true : values;
     } else {
       positional.push(arg);
killedBy: parseCliArgs positional arguments non-flag arg after a value-flag is consumed as the flag's value, not positional
statusReason: expected true to deeply equal [ '/tmp/project' ]

[Timeout] BlockStatement
src/cli/args.ts:47:12
         i++;
       }
       flags[key] = values.length === 0 ? true : values;
-    } else {
-      positional.push(arg);
-      i++;
-    }
+    } else {}
   }
 

[Killed] UpdateOperator
src/cli/args.ts:49:7
       flags[key] = values.length === 0 ? true : values;
     } else {
       positional.push(arg);
-      i++;
+      i--;
     }
   }
killedBy: parseCliArgs command extraction extracts command from first argument
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] ObjectLiteral
src/cli/args.ts:53:10
     }
   }
 
-  return { command, positional, flags };
+  return {};
 }
 
killedBy: parseCliArgs command extraction extracts command from first argument
statusReason: expected undefined to be 'audit' // Object.is equality

[Killed] BlockStatement
src/cli/args.ts:62:68
  * @param flags - Parsed flags map
  * @param key - Flag name
  */
-export function str(flags: Flags, key: string): string | undefined {
-  const v = flags[key];
-  return Array.isArray(v) ? v[0] : undefined;
-}
+export function str(flags: Flags, key: string): string | undefined {}
 
 /**
killedBy: str helper returns first element of an array flag
statusReason: expected undefined to be 'typescript' // Object.is equality

[Killed] BlockStatement
src/cli/args.ts:73:70
  * @param flags - Parsed flags map
  * @param key - Flag name
  */
-export function arr(flags: Flags, key: string): string[] | undefined {
-  const v = flags[key];
-  return Array.isArray(v) && v.length > 0 ? v : undefined;
-}
+export function arr(flags: Flags, key: string): string[] | undefined {}
 
 /**
killedBy: arr helper returns array for array flag
statusReason: expected undefined to deeply equal [ 'API', 'CLI' ]

[Killed] ConditionalExpression
src/cli/args.ts:75:10
  */
 export function arr(flags: Flags, key: string): string[] | undefined {
   const v = flags[key];
-  return Array.isArray(v) && v.length > 0 ? v : undefined;
+  return false ? v : undefined;
 }
 
killedBy: arr helper returns array for array flag
statusReason: expected undefined to deeply equal [ 'API', 'CLI' ]

[Killed] ConditionalExpression
src/cli/args.ts:75:10
  */
 export function arr(flags: Flags, key: string): string[] | undefined {
   const v = flags[key];
-  return Array.isArray(v) && v.length > 0 ? v : undefined;
+  return true ? v : undefined;
 }
 
killedBy: arr helper returns undefined for boolean flag
statusReason: expected true to be undefined

[Killed] BlockStatement
src/cli/args.ts:85:79
  * @param key - Flag name
  * @param defaultVal - Default if absent
  */
-export function bool(flags: Flags, key: string, defaultVal: boolean): boolean {
-  const v = flags[key];
-  return typeof v === "boolean" ? v : defaultVal;
-}
+export function bool(flags: Flags, key: string, defaultVal: boolean): boolean {}
 
killedBy: bool helper returns true for boolean true flag
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/cli/args.ts:87:10
  */
 export function bool(flags: Flags, key: string, defaultVal: boolean): boolean {
   const v = flags[key];
-  return typeof v === "boolean" ? v : defaultVal;
+  return true ? v : defaultVal;
 }
 
killedBy: bool helper returns defaultVal when flag is absent
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/cli/args.ts:87:10
  */
 export function bool(flags: Flags, key: string, defaultVal: boolean): boolean {
   const v = flags[key];
-  return typeof v === "boolean" ? v : defaultVal;
+  return false ? v : defaultVal;
 }
 
killedBy: bool helper returns true for boolean true flag
statusReason: expected false to be true // Object.is equality
