[Killed] ArrayDeclaration
src/registry/sentinel-renderer.ts:53:33
   context: RenderContext,
 ): SentinelFile[] {
   const byDomain = groupBlocksByDomain(blocks);
-  const files: SentinelFile[] = [];
+  const files: SentinelFile[] = ["Stryker was here"];
 
   // Generate domain standards files
killedBy: renderSentinelTree — structure empty_blocks_returns_only_claude_md_with_no_domain_files
statusReason: expected [ { …(2) }, 'Stryker was here' ] to have a length of 1 but got 2

[Killed] BlockStatement
src/registry/sentinel-renderer.ts:58:50
   // Generate domain standards files
   const domainsWithContent: Array<{ domain: string; description: string }> = [];
 
-  for (const [domain, domainBlocks] of byDomain) {
-    if (domainBlocks.length === 0) continue;
-
-    const content = renderDomainFile(domain, domainBlocks, context);
-    files.push({ relativePath: `.claude/standards/${domain}.md`, content });
-
-    const description = DOMAIN_DESCRIPTIONS[domain] ?? domain;
-    domainsWithContent.push({ domain, description });
-  }
+  for (const [domain, domainBlocks] of byDomain) {}
 
   // Sort domains for consistent wayfinding table order
killedBy: renderSentinelTree — structure produces_separate_domain_file_per_domain
statusReason: expected [ 'CLAUDE.md' ] to include '.claude/standards/architecture.md'

[Killed] EqualityOperator
src/registry/sentinel-renderer.ts:59:9
   const domainsWithContent: Array<{ domain: string; description: string }> = [];
 
   for (const [domain, domainBlocks] of byDomain) {
-    if (domainBlocks.length === 0) continue;
+    if (domainBlocks.length !== 0) continue;
 
     const content = renderDomainFile(domain, domainBlocks, context);
killedBy: renderSentinelTree — structure produces_separate_domain_file_per_domain
statusReason: expected [ 'CLAUDE.md' ] to include '.claude/standards/architecture.md'

[Killed] ConditionalExpression
src/registry/sentinel-renderer.ts:59:9
   const domainsWithContent: Array<{ domain: string; description: string }> = [];
 
   for (const [domain, domainBlocks] of byDomain) {
-    if (domainBlocks.length === 0) continue;
+    if (true) continue;
 
     const content = renderDomainFile(domain, domainBlocks, context);
killedBy: renderSentinelTree — structure produces_separate_domain_file_per_domain
statusReason: expected [ 'CLAUDE.md' ] to include '.claude/standards/architecture.md'

[Survived] LogicalOperator
src/registry/sentinel-renderer.ts:64:25
     const content = renderDomainFile(domain, domainBlocks, context);
     files.push({ relativePath: `.claude/standards/${domain}.md`, content });
 
-    const description = DOMAIN_DESCRIPTIONS[domain] ?? domain;
+    const description = DOMAIN_DESCRIPTIONS[domain] && domain;
     domainsWithContent.push({ domain, description });
   }

[Survived] MethodExpression
src/registry/sentinel-renderer.ts:69:3
   }
 
   // Sort domains for consistent wayfinding table order
-  domainsWithContent.sort(
-    (a, b) =>
-      (DOMAIN_ORDER.indexOf(a.domain) ?? 99) -
-      (DOMAIN_ORDER.indexOf(b.domain) ?? 99),
-  );
+  domainsWithContent;
 
   // Generate sentinel CLAUDE.md (prepend so it's first in the list)

[Survived] ArrowFunction
src/registry/sentinel-renderer.ts:70:5
 
   // Sort domains for consistent wayfinding table order
   domainsWithContent.sort(
-    (a, b) =>
-      (DOMAIN_ORDER.indexOf(a.domain) ?? 99) -
-      (DOMAIN_ORDER.indexOf(b.domain) ?? 99),
+    () => undefined,
   );
 

[Survived] LogicalOperator
src/registry/sentinel-renderer.ts:71:8
   // Sort domains for consistent wayfinding table order
   domainsWithContent.sort(
     (a, b) =>
-      (DOMAIN_ORDER.indexOf(a.domain) ?? 99) -
+      (DOMAIN_ORDER.indexOf(a.domain) && 99) -
       (DOMAIN_ORDER.indexOf(b.domain) ?? 99),
   );

[Survived] ArithmeticOperator
src/registry/sentinel-renderer.ts:71:7
   // Sort domains for consistent wayfinding table order
   domainsWithContent.sort(
     (a, b) =>
-      (DOMAIN_ORDER.indexOf(a.domain) ?? 99) -
-      (DOMAIN_ORDER.indexOf(b.domain) ?? 99),
+      (DOMAIN_ORDER.indexOf(a.domain) ?? 99) + (DOMAIN_ORDER.indexOf(b.domain) ?? 99),
   );
 

[Survived] LogicalOperator
src/registry/sentinel-renderer.ts:72:8
   domainsWithContent.sort(
     (a, b) =>
       (DOMAIN_ORDER.indexOf(a.domain) ?? 99) -
-      (DOMAIN_ORDER.indexOf(b.domain) ?? 99),
+      (DOMAIN_ORDER.indexOf(b.domain) && 99),
   );
 

[Killed] BlockStatement
src/registry/sentinel-renderer.ts:92:36
  */
 function groupBlocksByDomain(
   blocks: InstructionBlock[],
-): Map<string, InstructionBlock[]> {
-  const map = new Map<string, InstructionBlock[]>();
-
-  for (const block of blocks) {
-    const domain = BLOCK_DOMAIN_MAP[block.id] ?? "protocols";
-    const existing = map.get(domain) ?? [];
-    existing.push(block);
-    map.set(domain, existing);
-  }
-
-  return map;
-}
+): Map<string, InstructionBlock[]> {}
 
 /**
killedBy: renderSentinelTree — structure returns_claude_md_as_first_file
statusReason: byDomain is not iterable

[Killed] BlockStatement
src/registry/sentinel-renderer.ts:95:31
 ): Map<string, InstructionBlock[]> {
   const map = new Map<string, InstructionBlock[]>();
 
-  for (const block of blocks) {
-    const domain = BLOCK_DOMAIN_MAP[block.id] ?? "protocols";
-    const existing = map.get(domain) ?? [];
-    existing.push(block);
-    map.set(domain, existing);
-  }
+  for (const block of blocks) {}
 
   return map;
killedBy: renderSentinelTree — structure produces_separate_domain_file_per_domain
statusReason: expected [ 'CLAUDE.md' ] to include '.claude/standards/architecture.md'

[Killed] LogicalOperator
src/registry/sentinel-renderer.ts:96:20
   const map = new Map<string, InstructionBlock[]>();
 
   for (const block of blocks) {
-    const domain = BLOCK_DOMAIN_MAP[block.id] ?? "protocols";
+    const domain = BLOCK_DOMAIN_MAP[block.id] && "protocols";
     const existing = map.get(domain) ?? [];
     existing.push(block);
killedBy: renderSentinelTree — structure produces_separate_domain_file_per_domain
statusReason: expected [ 'CLAUDE.md', …(1) ] to include '.claude/standards/architecture.md'

[Killed] LogicalOperator
src/registry/sentinel-renderer.ts:97:22
 
   for (const block of blocks) {
     const domain = BLOCK_DOMAIN_MAP[block.id] ?? "protocols";
-    const existing = map.get(domain) ?? [];
+    const existing = map.get(domain) && [];
     existing.push(block);
     map.set(domain, existing);
killedBy: renderSentinelTree — structure returns_claude_md_as_first_file
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ArrayDeclaration
src/registry/sentinel-renderer.ts:97:41
 
   for (const block of blocks) {
     const domain = BLOCK_DOMAIN_MAP[block.id] ?? "protocols";
-    const existing = map.get(domain) ?? [];
+    const existing = map.get(domain) ?? ["Stryker was here"];
     existing.push(block);
     map.set(domain, existing);
killedBy: renderSentinelTree — structure returns_claude_md_as_first_file
statusReason: Cannot read properties of undefined (reading 'replace')

[Killed] BlockStatement
src/registry/sentinel-renderer.ts:118:11
   domain: string,
   blocks: InstructionBlock[],
   context: RenderContext,
-): string {
-  const date = new Date().toISOString().split("T")[0];
-  const lines: string[] = [
-    `<!-- ForgeCraft sentinel: ${domain} | ${date} | npx forgecraft-mcp refresh . --apply to update -->`,
-    "",
-  ];
-
-  for (const block of blocks) {
-    const rendered = renderTemplate(block.content, context).trim();
-    if (rendered) {
-      lines.push(rendered);
-      lines.push("");
-    }
-  }
-
-  return lines.join("\n");
-}
+): string {}
 
 /**
killedBy: renderSentinelTree — structure unknown_block_ids_route_to_protocols_not_discarded
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] BlockStatement
src/registry/sentinel-renderer.ts:125:31
     "",
   ];
 
-  for (const block of blocks) {
-    const rendered = renderTemplate(block.content, context).trim();
-    if (rendered) {
-      lines.push(rendered);
-      lines.push("");
-    }
-  }
+  for (const block of blocks) {}
 
   return lines.join("\n");
killedBy: renderSentinelTree — structure unknown_block_ids_route_to_protocols_not_discarded
statusReason: expected '<!-- ForgeCraft sentinel: protocols |…' to contain 'Some protocol content here'

[Killed] MethodExpression
src/registry/sentinel-renderer.ts:126:22
   ];
 
   for (const block of blocks) {
-    const rendered = renderTemplate(block.content, context).trim();
+    const rendered = renderTemplate(block.content, context);
     if (rendered) {
       lines.push(rendered);
killedBy: renderSentinelTree — domain file content block_content_is_trimmed_before_inclusion_in_domain_file
statusReason: expected '   ## Trimmed Rule' to be '## Trimmed Rule' // Object.is equality

[Killed] ConditionalExpression
src/registry/sentinel-renderer.ts:127:9
 
   for (const block of blocks) {
     const rendered = renderTemplate(block.content, context).trim();
-    if (rendered) {
+    if (true) {
       lines.push(rendered);
       lines.push("");
killedBy: renderSentinelTree — domain file content empty_block_content_is_not_added_to_domain_file
statusReason: expected 4 to be less than or equal to 3

[Killed] BlockStatement
src/registry/sentinel-renderer.ts:127:19
 
   for (const block of blocks) {
     const rendered = renderTemplate(block.content, context).trim();
-    if (rendered) {
-      lines.push(rendered);
-      lines.push("");
-    }
+    if (rendered) {}
   }
 
killedBy: renderSentinelTree — structure unknown_block_ids_route_to_protocols_not_discarded
statusReason: expected '<!-- ForgeCraft sentinel: protocols |…' to contain 'Some protocol content here'

[Killed] BlockStatement
src/registry/sentinel-renderer.ts:149:11
 function renderSentinelClaudeMd(
   _domains: Array<{ domain: string; description: string }>,
   context: RenderContext,
-): string {
-  const date = new Date().toISOString().split("T")[0];
-  const description = buildProjectDescription(context);
-  return [
-    `# ${context.projectName}`,
-    `<!-- ForgeCraft sentinel | ${date} | npx forgecraft-mcp refresh . --apply to update -->`,
-    description,
-    ``,
-    `Read \`.claude/index.md\` before any task. Navigate to the relevant branch. Load core.md always.`,
-    ``,
-  ].join("\n");
-}
+): string {}
 
 /**
killedBy: renderSentinelTree — structure claude_md_is_sentinel_not_monolithic
statusReason: Cannot read properties of undefined (reading 'split')

[Killed] BlockStatement
src/registry/sentinel-renderer.ts:169:66
  * @param context - Render context
  * @returns Single sentence describing the project
  */
-function buildProjectDescription(context: RenderContext): string {
-  const nonUniversal = context.tags.filter((t) => t !== "UNIVERSAL");
-  if (context.domain && context.domain !== "none") {
-    return `A ${context.domain} project. Must not become a monolith — navigate via \`.claude/index.md\`.`;
-  }
-  if (nonUniversal.length > 0) {
-    return `A ${nonUniversal.map((t) => t.toLowerCase()).join(", ")} project. Must not become a monolith.`;
-  }
-  return `<!-- FILL: one sentence — what this project is and what it must not become -->`;
-}
+function buildProjectDescription(context: RenderContext): string {}
 
killedBy: renderSentinelTree — CLAUDE.md content uses_tag_names_in_description_when_no_domain_set
statusReason: expected '# TestProject\n<!-- ForgeCraft sentin…' to contain 'api'

[Killed] ConditionalExpression
src/registry/sentinel-renderer.ts:170:51
  * @returns Single sentence describing the project
  */
 function buildProjectDescription(context: RenderContext): string {
-  const nonUniversal = context.tags.filter((t) => t !== "UNIVERSAL");
+  const nonUniversal = context.tags.filter((t) => true);
   if (context.domain && context.domain !== "none") {
     return `A ${context.domain} project. Must not become a monolith — navigate via \`.claude/index.md\`.`;
killedBy: renderSentinelTree — CLAUDE.md content universal_tag_is_excluded_from_description
statusReason: expected '# testproject\n<!-- forgecraft sentin…' not to contain 'universal'

[Killed] MethodExpression
src/registry/sentinel-renderer.ts:170:24
  * @returns Single sentence describing the project
  */
 function buildProjectDescription(context: RenderContext): string {
-  const nonUniversal = context.tags.filter((t) => t !== "UNIVERSAL");
+  const nonUniversal = context.tags;
   if (context.domain && context.domain !== "none") {
     return `A ${context.domain} project. Must not become a monolith — navigate via \`.claude/index.md\`.`;
killedBy: renderSentinelTree — CLAUDE.md content universal_tag_is_excluded_from_description
statusReason: expected '# testproject\n<!-- forgecraft sentin…' not to contain 'universal'

[Killed] ConditionalExpression
src/registry/sentinel-renderer.ts:171:7
  */
 function buildProjectDescription(context: RenderContext): string {
   const nonUniversal = context.tags.filter((t) => t !== "UNIVERSAL");
-  if (context.domain && context.domain !== "none") {
+  if (true) {
     return `A ${context.domain} project. Must not become a monolith — navigate via \`.claude/index.md\`.`;
   }
killedBy: renderSentinelTree — CLAUDE.md content uses_tag_names_in_description_when_no_domain_set
statusReason: expected '# TestProject\n<!-- ForgeCraft sentin…' to contain 'api'

[Killed] EqualityOperator
src/registry/sentinel-renderer.ts:171:25
  */
 function buildProjectDescription(context: RenderContext): string {
   const nonUniversal = context.tags.filter((t) => t !== "UNIVERSAL");
-  if (context.domain && context.domain !== "none") {
+  if (context.domain && context.domain === "none") {
     return `A ${context.domain} project. Must not become a monolith — navigate via \`.claude/index.md\`.`;
   }
killedBy: renderSentinelTree — CLAUDE.md content uses_tag_names_in_description_when_no_domain_set
statusReason: expected '# TestProject\n<!-- ForgeCraft sentin…' to contain 'api'

[Killed] ConditionalExpression
src/registry/sentinel-renderer.ts:174:7
   if (context.domain && context.domain !== "none") {
     return `A ${context.domain} project. Must not become a monolith — navigate via \`.claude/index.md\`.`;
   }
-  if (nonUniversal.length > 0) {
+  if (true) {
     return `A ${nonUniversal.map((t) => t.toLowerCase()).join(", ")} project. Must not become a monolith.`;
   }
killedBy: renderSentinelTree — CLAUDE.md content fallback_comment_when_no_tags_and_no_domain
statusReason: expected '# TestProject\n<!-- ForgeCraft sentin…' to contain 'FILL:'

[Killed] BlockStatement
src/registry/sentinel-renderer.ts:174:32
   if (context.domain && context.domain !== "none") {
     return `A ${context.domain} project. Must not become a monolith — navigate via \`.claude/index.md\`.`;
   }
-  if (nonUniversal.length > 0) {
-    return `A ${nonUniversal.map((t) => t.toLowerCase()).join(", ")} project. Must not become a monolith.`;
-  }
+  if (nonUniversal.length > 0) {}
   return `<!-- FILL: one sentence — what this project is and what it must not become -->`;
 }
killedBy: renderSentinelTree — CLAUDE.md content uses_tag_names_in_description_when_no_domain_set
statusReason: expected '# TestProject\n<!-- ForgeCraft sentin…' to contain 'api'

[Killed] ArrowFunction
src/registry/sentinel-renderer.ts:175:34
     return `A ${context.domain} project. Must not become a monolith — navigate via \`.claude/index.md\`.`;
   }
   if (nonUniversal.length > 0) {
-    return `A ${nonUniversal.map((t) => t.toLowerCase()).join(", ")} project. Must not become a monolith.`;
+    return `A ${nonUniversal.map(() => undefined).join(", ")} project. Must not become a monolith.`;
   }
   return `<!-- FILL: one sentence — what this project is and what it must not become -->`;
killedBy: renderSentinelTree — CLAUDE.md content uses_tag_names_in_description_when_no_domain_set
statusReason: expected '# TestProject\n<!-- ForgeCraft sentin…' to contain 'api'

[Killed] MethodExpression
src/registry/sentinel-renderer.ts:175:41
     return `A ${context.domain} project. Must not become a monolith — navigate via \`.claude/index.md\`.`;
   }
   if (nonUniversal.length > 0) {
-    return `A ${nonUniversal.map((t) => t.toLowerCase()).join(", ")} project. Must not become a monolith.`;
+    return `A ${nonUniversal.map((t) => t.toUpperCase()).join(", ")} project. Must not become a monolith.`;
   }
   return `<!-- FILL: one sentence — what this project is and what it must not become -->`;
killedBy: renderSentinelTree — CLAUDE.md content uses_tag_names_in_description_when_no_domain_set
statusReason: expected '# TestProject\n<!-- ForgeCraft sentin…' to contain 'api'
